all_hide_info = {
    '姤': {16: ('生', '长')}, '遁': {16: ('', '死'), 17: ('克', '墓')}, '否': {17: ('克', '养')},
    '观': {13: ('克', '长'), 17: ('克', '养')}, '剥': {13: ('', '死')}, '晋': {17: ('克', '养')},
    '豫': {17: ('克', '养')}, '解': {17: ('', '病')}, '恒': {16: ('生', '长')},
    '升': {14: ('', '养'), 16: ('生', '长')}, '井': {14: ('', '病'), 16: ('生', '长')},
    '大过': {14: ('克', '绝'), 16: ('生', '长')}, '随': {14: ('克', '绝')}, '屯': {15: ('', '冠')},
    '既济': {15: ('克', '绝')}, '革': {15: ('克', '绝')}, '明夷': {15: ('克', '绝')}, '小畜': {15: ('生', '养')},
    '家人': {15: ('', '病')}, '益': {15: ('生', '养')}, '颐': {13: ('克', '胎'), 15: ('生', '养')},
    '蛊': {13: ('克', '胎')}, '贲': {15: ('', '病'), 16: ('', '养')}, '大畜': {15: ('生', '养'), 16: ('生', '长')},
    '损': {15: ('生', '墓')}, '睽': {13: ('克', '养')}, '履': {13: ('生', '长')},
    '中孚': {13: ('', '绝'), 15: ('生', '墓')}, '渐': {13: ('', '绝')}, '复': {16: ('生', '长')},
    '泰': {16: ('生', '长')}, '夬': {16: ('生', '长')}, '需': {16: ('生', '长')},
    '旅': {15: ('生', '长'), 17: ('', '衰')}, '鼎': {17: ('', '冠')}, '未济': {15: ('', '胎')},
    '蒙': {14: ('生', '衰')}, '涣': {14: ('生', '冠'), 15: ('', '胎')}, '讼': {15: ('', '胎')},
    '咸': {16: ('', '死')}, '蹇': {16: ('', '死')}, '谦': {16: ('', '死')}, '小过': {14: ('', '胎'), 16: ('', '死')},
    '归妹': {14: ('', '胎')}
    # 使用方法：dic['姤'][16] = ('生', '长')
    # 提示：16 = 12 + 1~5（五爻到初爻）
    # puzzle:飞神生，飞神长生，飞神死地，飞神胎地
}
GUA_SHU = [[11, 9, 7, 5, 3, 1], [11, 9, 7, 10, 12, 2], [11, 9, 7, 9, 7, 5], [11, 9, 7, 4, 6, 8], [4, 6, 8, 4, 6, 8],
           [3, 1, 11, 4, 6, 8], [6, 8, 10, 4, 6, 8], [6, 8, 10, 5, 3, 1], [11, 9, 7, 5, 3, 1], [11, 9, 7, 4, 6, 8],
           [11, 9, 7, 7, 5, 3], [11, 9, 7, 10, 12, 2], [10, 12, 2, 10, 12, 2], [1, 11, 9, 10, 12, 2],
           [8, 10, 12, 10, 12, 2],
           [8, 10, 12, 5, 3, 1], [1, 11, 9, 7, 5, 3], [1, 11, 9, 2, 4, 6], [1, 11, 9, 5, 3, 1], [1, 11, 9, 12, 2, 4],
           [8, 10, 12, 12, 2, 4], [11, 9, 7, 12, 2, 4], [10, 12, 2, 12, 2, 4], [10, 12, 2, 7, 5, 3],
           [4, 6, 8, 10, 12, 2],
           [4, 6, 8, 5, 3, 1], [4, 6, 8, 12, 2, 4], [4, 6, 8, 5, 3, 1], [11, 9, 7, 5, 3, 1], [6, 8, 10, 5, 3, 1],
           [3, 1, 11, 5, 3, 1], [3, 1, 11, 10, 12, 2], [3, 1, 11, 9, 7, 5], [3, 1, 11, 12, 2, 4], [3, 1, 11, 5, 3, 1],
           [3, 1, 11, 2, 4, 6], [6, 8, 10, 2, 4, 6], [11, 9, 7, 2, 4, 6], [4, 6, 8, 2, 4, 6], [4, 6, 8, 9, 7, 5],
           [10, 12, 2, 4, 6, 8], [10, 12, 2, 5, 3, 1], [10, 12, 2, 2, 4, 6], [10, 12, 2, 5, 3, 1], [11, 9, 7, 5, 3, 1],
           [8, 10, 12, 5, 3, 1], [1, 11, 9, 5, 3, 1], [1, 11, 9, 4, 6, 8], [6, 8, 10, 12, 2, 4], [6, 8, 10, 9, 7, 5],
           [6, 8, 10, 10, 12, 2], [6, 8, 10, 7, 5, 3], [3, 1, 11, 7, 5, 3], [4, 6, 8, 7, 5, 3], [11, 9, 7, 7, 5, 3],
           [11, 9, 7, 12, 2, 4], [8, 10, 12, 2, 4, 6], [8, 10, 12, 7, 5, 3], [8, 10, 12, 4, 6, 8], [8, 10, 12, 9, 7, 5],
           [1, 11, 9, 9, 7, 5], [10, 12, 2, 9, 7, 5], [11, 9, 7, 9, 7, 5], [11, 9, 7, 2, 4, 6]]
HIDE_SHU = [[None, None, None, None, None, None], [None, None, None, None, 3, None],
            [None, None, None, None, 3, 1],
            [None, None, None, None, None, 1], [None, 9, None, None, None, 1], [None, 9, None, None, None, None],
            [None, None, None, None, None, 1], [None, None, None, None, None, None],
            [None, None, None, None, None, None],
            [None, None, None, None, None, 1], [None, None, None, None, None, 1],
            [None, None, None, None, 3, None],
            [None, None, 7, None, 3, None], [None, None, 7, None, 3, None], [None, None, 7, None, 3, None],
            [None, None, 7, None, None, None], [None, None, None, None, None, None],
            [None, None, None, None, None, None],
            [None, None, None, 7, None, None], [None, None, None, 7, None, None],
            [None, None, None, 7, None, None],
            [None, None, None, None, None, None], [None, None, None, 7, None, None],
            [None, None, None, None, None, None],
            [None, None, None, None, None, None], [None, None, None, 10, None, None],
            [None, None, None, 10, None, None],
            [None, None, None, 10, None, None], [None, None, None, None, None, None],
            [None, None, None, None, None, None],
            [None, 6, None, 10, None, None], [None, 6, None, None, None, None],
            [None, None, None, None, None, None],
            [None, None, None, 9, 7, None], [None, None, None, 9, 7, None], [None, None, None, 9, None, None],
            [None, 1, None, None, None, None], [None, 1, None, None, None, None], [None, 1, None, 9, None, None],
            [None, 1, None, None, None, None], [None, None, None, None, None, None],
            [None, None, None, None, 6, None],
            [None, None, None, None, None, None], [None, None, None, None, 6, None],
            [None, None, None, None, None, None],
            [None, None, None, None, 6, None], [None, None, None, None, 6, None],
            [None, None, None, None, None, None],
            [None, None, None, None, None, None], [None, None, None, 12, None, 4],
            [None, None, None, None, None, 4],
            [None, None, None, 12, None, None], [None, None, 10, None, None, None],
            [None, None, 10, 12, None, None],
            [None, None, None, 12, None, None], [None, None, None, None, None, None],
            [None, None, None, None, None, None],
            [None, None, None, None, None, None], [None, None, None, None, None, None],
            [None, None, None, None, 4, None],
            [None, None, None, None, 4, None], [None, None, None, None, 4, None],
            [None, None, 12, None, 4, None],
            [None, None, 12, None, None, None]]
LIU_QIN_NUM_60 = [[36, 37, 14, 51, 52, 17, 6, 7, 20, 33, 34, 23], [12, 13, 50, 27, 28, 53, 42, 43, 56, 9, 10, 59],
                  [48, 49, 26, 3, 4, 29, 18, 19, 32, 45, 46, 35], [0, 1, 38, 15, 16, 41, 30, 31, 44, 57, 58, 47],
                  [24, 25, 2, 39, 40, 5, 54, 55, 8, 21, 22, 11]]
FAMILY = ['父母亥水', '父母子水', '父母丑土', '父母寅木', '父母卯木', '父母辰土', '父母巳火', '父母午火', '父母未土',
          '父母申金', '父母酉金', '父母戌土', '兄弟亥水', '兄弟子水', '兄弟丑土', '兄弟寅木', '兄弟卯木', '兄弟辰土',
          '兄弟巳火', '兄弟午火', '兄弟未土', '兄弟申金', '兄弟酉金', '兄弟戌土', '子孙亥水', '子孙子水', '子孙丑土',
          '子孙寅木', '子孙卯木', '子孙辰土', '子孙巳火', '子孙午火', '子孙未土', '子孙申金', '子孙酉金', '子孙戌土',
          '妻财亥水', '妻财子水', '妻财丑土', '妻财寅木', '妻财卯木', '妻财辰土', '妻财巳火', '妻财午火', '妻财未土',
          '妻财申金', '妻财酉金', '妻财戌土', '官鬼亥水', '官鬼子水', '官鬼丑土', '官鬼寅木', '官鬼卯木', '官鬼辰土',
          '官鬼巳火', '官鬼午火', '官鬼未土', '官鬼申金', '官鬼酉金', '官鬼戌土', '官鬼亥水']
REMINDER_TO_WU_XING = [4, 3, 1, 3, 0, 0, 2, 4]  # example:REMINDER_TO_WU_XING[gua_num // 8]
GAN = ["癸", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬"]
ZHI = ["亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌"]
YONG_SHEN = ["父母", '兄弟', '子孙', '妻财', '官鬼', '世', '应']
ANIMALS = ["青龙", "朱雀", "勾陈", "腾蛇", "白虎", "玄武"]
YAO_WEI = ["六", "五", "四", "三", "二", "初"]
KEY_SAYING = {"腾蛇": "性格行为古怪，孤僻。临元神为不安，被冲克更是。",
              "白虎": "性格暴躁，着急", "白虎水爻": "白虎水爻为血。",
              "青龙": "青龙主家务日常",
              "朱雀": "朱雀主口舌，发炎发烧。",
              "勾陈": "勾陈主懒惰，迟钝。用神临勾陈，不动之象。",
              "玄武": "玄武主郁闷压抑，心情不好，日月克尤甚。", }
GUA_INFO = [
    ['<五爻克宅>', '<五爻生宅>', '<宅爻克五>', '<宅爻克五>', '<五宅比和>', '<五爻克宅>', '<宅爻生五>', '<宅爻克五>',
     '<五爻克宅>',
     '<宅爻克五>', '<宅爻生五>', '<五爻生宅>', '<五宅比和>', '<五爻克宅>', '<五爻生宅>', '<五爻克宅>', '<五宅比和>',
     '<宅爻克五>',
     '<宅爻克五>', '<五宅比和>', '<宅爻生五>', '<宅爻生五>', '<宅爻克五>', '<宅爻克五>', '<宅爻克五>', '<宅爻生五>',
     '<五爻生宅>',
     '<宅爻生五>', '<五爻克宅>', '<宅爻克五>', '<五爻生宅>', '<五宅比和>', '<五爻克宅>', '<宅爻克五>', '<五爻生宅>',
     '<五爻生宅>',
     '<宅爻克五>', '<五爻克宅>', '<宅爻生五>', '<五宅比和>', '<五爻克宅>', '<五爻生宅>', '<五爻生宅>', '<五爻生宅>',
     '<五爻克宅>',
     '<五爻克宅>', '<宅爻克五>', '<宅爻生五>', '<五宅比和>', '<宅爻生五>', '<五爻克宅>', '<五宅比和>', '<宅爻克五>',
     '<五爻生宅>',
     '<宅爻生五>', '<宅爻生五>', '<五爻克宅>', '<宅爻生五>', '<宅爻克五>', '<宅爻克五>', '<宅爻生五>', '<五爻克宅>',
     '<宅爻克五>',
     '<五爻克宅>'],
    ['<世应比和>', '<应爻生世>', '<世爻克应>', '<世爻克应>', '<世应比和>', '<世爻克应>', '<应爻生世>', '<应爻生世>',
     '<世应比和>',
     '<应爻生世>', '<世爻生应>', '<应爻生世>', '<世应比和>', '<世爻克应>', '<应爻克世>', '<世应比和>', '<世爻克应>',
     '<世爻克应>',
     '<世爻克应>', '<世应比和>', '<世爻生应>', '<应爻生世>', '<应爻克世>', '<世爻克应>', '<应爻克世>', '<应爻克世>',
     '<应爻生世>',
     '<应爻克世>', '<应爻克世>', '<应爻克世>', '<世爻克应>', '<世爻克应>', '<应爻克世>', '<世爻克应>', '<应爻生世>',
     '<应爻克世>',
     '<应爻克世>', '<世爻克应>', '<应爻生世>', '<世爻克应>', '<世爻克应>', '<应爻克世>', '<应爻生世>', '<世爻生应>',
     '<应爻克世>',
     '<世爻克应>', '<世爻生应>', '<应爻生世>', '<应爻克世>', '<世爻生应>', '<应爻克世>', '<世应比和>', '<应爻克世>',
     '<世爻生应>',
     '<应爻生世>', '<应爻克世>', '<世应比和>', '<应爻生世>', '<世爻克应>', '<应爻生世>', '<应爻生世>', '<世爻克应>',
     '<世爻生应>',
     '<世应比和>'],
    ['<八卦纯阳>', '', '<八卦纯阳>', '', '<八卦纯阴>', '', '<八卦纯阴>', '', '<八卦纯阳>', '', '<八卦纯阳>', '',
     '<八卦纯阴>', '', '<八卦纯阴>', '', '<八卦纯阳>', '', '<八卦纯阳>', '', '<八卦纯阴>', '', '<八卦纯阴>', '',
     '<八卦纯阴>', '', '<八卦纯阴>', '', '<八卦纯阳>', '', '<八卦纯阳>', '', '<八卦纯阳>', '', '<八卦纯阳>', '',
     '<八卦纯阴>', '', '<八卦纯阴>', '', '<八卦纯阴>', '', '<八卦纯阴>', '', '<八卦纯阳>', '', '<八卦纯阳>', '',
     '<八卦纯阴>', '', '<八卦纯阴>', '', '<八卦纯阳>', '', '<八卦纯阳>', '', '<八卦纯阴>', '', '<八卦纯阴>', '',
     '<八卦纯阳>', '', '<八卦纯阳>', ''],
    ['', '', '', '', '', '', '', '<世应同宫>', '', '<世五同宫>', '', '<应二同宫>', '', '<世应同宫>', '', '', '', '', '',
     '<世五同宫>', '', '', '', '', '', '', '', '<世五同宫>', '', '', '', '<应初同宫>', '', '<应三同宫>', '',
     '<世应同宫>', '', '', '', '<世四同宫>', '', '<应二同宫>', '', '', '', '', '', '', '', '<世六同宫>', '',
     '<应二同宫>', '', '<世应同宫>', '', '<世应同宫>', '', '', '', '<世应同宫>', '', '', '', '']

]
GUA_GONG_INFO = [
    "乾宫卦，乾为头|肺|大肠，为领导|老男人，为镜。",
    "震宫卦，震为足，为肝，肝藏魂藏血，为闹市。",
    "坎宫卦，坎为水，为耳|肾|膀胱，为尿|精|血，为偷盗|诈骗|作弊|风险，为江河|大海。",
    "巽宫卦，巽为花草，为编程|电脑|人工智能，为女人，为眼，为癌症。",
    "艮宫卦，艮为山，为鼻|乳房|脖子|肩膀，为坟墓。",
    "坤宫卦，坤为地，为柔软，为脾胃，为老妇人。",
    "离宫卦，离为火|光|激光|明亮|太阳，为文书|信息|文字|数据|图片|视频，为眼|血液|心脏，为小肠，为中暑。",
    "兑宫卦，兑为语言|口语|说话|声，为口腔|进食，为损坏，为20来岁少女，为咳嗽。"
]
GUA_NUM_TO_LIST = {
    0: (1, 1, 1, 1, 1, 1), 1: (1, 1, 1, 1, 1, 2), 2: (1, 1, 1, 1, 2, 2), 3: (1, 1, 1, 2, 2, 2),
    4: (1, 1, 2, 2, 2, 2), 5: (1, 2, 2, 2, 2, 2), 6: (1, 2, 1, 2, 2, 2), 7: (1, 2, 1, 1, 1, 1),
    8: (2, 2, 1, 2, 2, 1), 9: (2, 2, 1, 2, 2, 2), 10: (2, 2, 1, 2, 1, 2), 11: (2, 2, 1, 1, 1, 2),
    12: (2, 2, 2, 1, 1, 2), 13: (2, 1, 2, 1, 1, 2), 14: (2, 1, 1, 1, 1, 2), 15: (2, 1, 1, 2, 2, 1),
    16: (2, 1, 2, 2, 1, 2), 17: (2, 1, 2, 2, 1, 1), 18: (2, 1, 2, 2, 2, 1), 19: (2, 1, 2, 1, 2, 1),
    20: (2, 1, 1, 1, 2, 1), 21: (2, 2, 1, 1, 2, 1), 22: (2, 2, 2, 1, 2, 1), 23: (2, 2, 2, 2, 1, 2),
    24: (1, 1, 2, 1, 1, 2), 25: (1, 1, 2, 1, 1, 1), 26: (1, 1, 2, 1, 2, 1), 27: (1, 1, 2, 2, 2, 1),
    28: (1, 1, 1, 2, 2, 1), 29: (1, 2, 1, 2, 2, 1), 30: (1, 2, 2, 2, 2, 1), 31: (1, 2, 2, 1, 1, 2),
    32: (1, 2, 2, 1, 2, 2), 33: (1, 2, 2, 1, 2, 1), 34: (1, 2, 2, 1, 1, 1), 35: (1, 2, 2, 2, 1, 1),
    36: (1, 2, 1, 2, 1, 1), 37: (1, 1, 1, 2, 1, 1), 38: (1, 1, 2, 2, 1, 1), 39: (1, 1, 2, 1, 2, 2),
    40: (2, 2, 2, 2, 2, 2), 41: (2, 2, 2, 2, 2, 1), 42: (2, 2, 2, 2, 1, 1), 43: (2, 2, 2, 1, 1, 1),
    44: (2, 2, 1, 1, 1, 1), 45: (2, 1, 1, 1, 1, 1), 46: (2, 1, 2, 1, 1, 1), 47: (2, 1, 2, 2, 2, 2),
    48: (1, 2, 1, 1, 2, 1), 49: (1, 2, 1, 1, 2, 2), 50: (1, 2, 1, 1, 1, 2), 51: (1, 2, 1, 2, 1, 2),
    52: (1, 2, 2, 2, 1, 2), 53: (1, 1, 2, 2, 1, 2), 54: (1, 1, 1, 2, 1, 2), 55: (1, 1, 1, 1, 2, 1),
    56: (2, 1, 1, 2, 1, 1), 57: (2, 1, 1, 2, 1, 2), 58: (2, 1, 1, 2, 2, 2), 59: (2, 1, 1, 1, 2, 2),
    60: (2, 1, 2, 1, 2, 2), 61: (2, 2, 2, 1, 2, 2), 62: (2, 2, 1, 1, 2, 2), 63: (2, 2, 1, 2, 1, 1)}


def gua_info_list_calculate(gua_num: int, biangua_num: int, trigger_li: list[int]):
    def search_After():
        li = [None] * 6
        if biangua_num <= 63:  # 不是静卦的话
            Biangua_li = GUA_SHU[biangua_num]
            for i, n in enumerate(trigger_li):
                if n:
                    li[i] = Biangua_li[i]
        return li

    # 顺序是Main，After，Hide
    li = GUA_SHU[gua_num].copy()  # 直接赋值的话，li将会直接在gua_shu的内存上修改extend，影响下次赋值。
    li.extend(search_After())
    li.extend(HIDE_SHU[gua_num])  # GuaShu_li.extend(search_hide(self.gua_num))
    return li


def search_self(Guanum: int):
    '''
    给卦的序号，找出世应的idx
    :param Guanum:卦的序号
    :return: List[self_idx,other_idx]（5-0代表初爻到六爻）
    '''
    remain = Guanum % 8
    # idx_to_selfposit = [6, 1, 2, 3, 4, 5, 4, 3]原本是1-6代表初爻到六爻
    REMAINDER_SELF = [0, 5, 4, 3, 2, 1, 2, 3]  # 现在是5-0代表初爻到六爻，贴合gua_shu的习惯
    REMAINDER_OTHER = [3, 2, 1, 0, 5, 4, 5, 0]
    return [REMAINDER_SELF[remain], REMAINDER_OTHER[remain]]


def gua_information(gua_num, wuxing, SixMode) -> None:
    '''根据主卦序数，卦宫五行，天干模式，输出headline'''
    self_posit, _ = search_self(gua_num)
    self_zhi = GUA_SHU[gua_num][self_posit]
    liu_shen = Sixmode_to_Animals(SixMode)[self_posit]
    Num = LIU_QIN_NUM_60[wuxing][self_zhi % 12]

    print("【反馈】")
    text = f"世爻{FAMILY[Num]}在{YAO_WEI[self_posit]}爻临{liu_shen},{KEY_SAYING[liu_shen]}\n{GUA_GONG_INFO[gua_num // 8]}\n"
    for info_lst in GUA_INFO:
        text += f"{info_lst[gua_num]}"
    print(text)


def Sixmode_to_Animals(Sixmode: int) -> list[str]:
    li = [ANIMALS[(Sixmode + 10 - i) % 6] for i in range(6)]
    return li
