guaxiang = [
    ["乾为天 (乾宫,六冲)", "  父母戌土", "′世", "○世", "  兄弟申金", "′  ", "○  ", "  官鬼午火", "′  ", "○  ",
     "  父母辰土", "′应", "○应", "  妻财寅木", "′  ", "○  ", "  子孙子水", "′  ", "○  "],
    ["天风姤 (乾宫)", "         父母戌土", "′  ", "○  ", "         兄弟申金", "′  ", "○  ", "         官鬼午火", "′应",
     "○应", "         兄弟酉金", "′  ", "○  ", "妻财寅木 子孙亥水", "′  ", "○  ", "         父母丑土", "″世", "×世"],
    ["天山遁 (乾宫)", "         父母戌土", "′  ", "○  ", "         兄弟申金", "′应", "○应", "         官鬼午火", "′  ",
     "○  ", "         兄弟申金", "′  ", "○  ", "妻财寅木 官鬼午火", "″世", "×世", "子孙子水 父母辰土", "″  ", "×  "],
    ["天地否 (乾宫,六合)", "         父母戌土", "′应", "○应", "         兄弟申金", "′  ", "○  ", "         官鬼午火",
     "′  ", "○  ", "         妻财卯木", "″世", "×世", "         官鬼巳火", "″  ", "×  ", "子孙子水 父母未土", "″  ",
     "×  "],
    ["风地观 (乾宫)", "         妻财卯木", "′  ", "○  ", "兄弟申金 官鬼巳火", "′  ", "○  ", "         父母未土", "″世",
     "×世", "         妻财卯木", "″  ", "×  ", "         官鬼巳火", "″  ", "×  ", "子孙子水 父母未土", "″应", "×应"],
    ["山地剥 (乾宫)", "         妻财寅木", "′  ", "○  ", "兄弟申金 子孙子水", "″世", "×世", "         父母戌土", "″  ",
     "×  ", "         妻财卯木", "″  ", "×  ", "         官鬼巳火", "″应", "×应", "         父母未土", "″  ", "×  "],
    ["火地晋 (乾宫,游魂)", "         官鬼巳火", "′  ", "○  ", "         父母未土", "″  ", "×  ", "         兄弟酉金",
     "′世", "○世", "         妻财卯木", "″  ", "×  ", "         官鬼巳火", "″  ", "×  ", "子孙子水 父母未土", "″应",
     "×应"],
    ["火天大有 (乾宫,归魂)", "  官鬼巳火", "′应", "○应", "  父母未土", "″  ", "×  ", "  兄弟酉金", "′  ", "○  ",
     "  父母辰土", "′世", "○世", "  妻财寅木", "′  ", "○  ", "  子孙子水", "′  ", "○  "],
    ["震为雷 (震宫,六冲)", "  妻财戌土", "″世", "×世", "  官鬼申金", "″  ", "×  ", "  子孙午火", "′  ", "○  ",
     "  妻财辰土", "″应", "×应", "  兄弟寅木", "″  ", "×  ", "  父母子水", "′  ", "○  "],
    ["雷地豫 (震宫,六合)", "         妻财戌土", "″  ", "×  ", "         官鬼申金", "″  ", "×  ", "         子孙午火",
     "′ 应", "○应", "         兄弟卯木", "″  ", "×  ", "         子孙巳火", "″  ", "×  ", "父母子水 妻财未土", "″世",
     "×世"],
    ["雷水解 (震宫)", "         妻财戌土", "″  ", "×  ", "         官鬼申金", "″应", "×应", "         子孙午火", "′  ",
     "○  ", "         子孙午火", "″  ", "×  ", "         妻财辰土", "′世", "○世", "父母子水 兄弟寅木", "″  ", "×  "],
    ["雷风恒 (震宫)", "         妻财戌土", "″应", "×应", "         官鬼申金", "″  ", "×  ", "         子孙午火", "′  ",
     "○  ", "         官鬼酉金", "′世", "○世", "兄弟寅木 父母亥水", "′  ", "○  ", "         妻财丑土", "″  ", "×  "],
    ["地风升 (震宫)", "         官鬼酉金", "″  ", "×  ", "         父母亥水", "″  ", "×  ", "子孙午火 妻财丑土", "″世",
     "×世", "         官鬼酉金", "′  ", "○  ", "兄弟寅木 父母亥水", "′  ", "○  ", "         妻财丑土", "″应", "×应"],
    ["水风井 (震宫)", "         父母子水", "″  ", "×  ", "         妻财戌土", "′世", "○世", "子孙午火 官鬼申金", "″  ",
     "×  ", "         官鬼酉金", "′  ", "○  ", "兄弟寅木 父母亥水", "′应", "○应", "         妻财丑土", "″  ", "×  "],
    ["泽风大过 (震宫,游魂)", "         妻财未土", "″  ", "×  ", "         官鬼酉金", "′  ", "○  ", "子孙午火 父母亥水",
     "′世", "○世", "         官鬼酉金", "′  ", "○  ", "兄弟寅木 父母亥水", "′  ", "○  ", "         妻财丑土", "″应",
     "×应"],
    ["泽雷随 (震宫,归魂)", "         妻财未土", "″应", "×应", "         官鬼酉金", "′  ", "○  ", "子孙午火 父母亥水",
     "′  ", "○  ", "         妻财辰土", "″世", "×世", "         兄弟寅木", "″  ", "×  ", "         父母子水", "′  ",
     "○  "],
    ["坎为水 (坎宫,六冲)", "  兄弟子水", "″世", "×世", "  官鬼戌土", "′  ", "○  ", "  父母申金", "″  ", "×  ",
     "  妻财午火", "″应", "×应", "  官鬼辰土", "′  ", "○  ", "  子孙寅木", "″  ", "×  "],
    ["水泽节 (坎宫,六合)", "  兄弟子水", "″  ", "×  ", "  官鬼戌土", "′  ", "○  ", "  父母申金", "″应", "×应",
     "  官鬼丑土", "″  ", "×  ", "  子孙卯木", "′  ", "○  ", "  妻财巳火", "′世", "○世"],
    ["水雷屯 (坎宫)", "         兄弟子水", "″  ", "×  ", "         官鬼戌土", "′应", "○应", "         父母申金", "″  ",
     "×  ", "妻财午火 官鬼辰土", "″  ", "×  ", "         子孙寅木", "″世", "×世", "         兄弟子水", "′  ", "○  "],
    ["水火既济 (坎宫)", "         兄弟子水", "″应", "×应", "         官鬼戌土", "′  ", "○  ", "         父母申金",
     "″  ", "×  ", "妻财午火 兄弟亥水", "′世", "○世", "         官鬼丑土", "″  ", "×  ", "         子孙卯木", "′  ",
     "○  "],
    ["泽火革 (坎宫)", "         官鬼未土", "″  ", "×  ", "         父母酉金", "′  ", "○  ", "         兄弟亥水", "′世",
     "○世", "妻财午火 兄弟亥水", "′  ", "○  ", "         官鬼丑土", "″  ", "×  ", "         子孙卯木", "′应", "○应"],
    ["雷火丰 (坎宫)", "  官鬼戌土", "″  ", "×  ", "  父母申金", "″世", "×世", "  妻财午火", "′  ", "○  ", "  兄弟亥水",
     "′  ", "○  ", "  官鬼丑土", "″应", "×应", "  子孙卯木", "′  ", "○  "],
    ["地火明夷 (坎宫,游魂)", "         父母酉金", "″  ", "×  ", "         兄弟亥水", "″  ", "×  ", "         官鬼丑土",
     "″世", "×世", "妻财午火 兄弟亥水", "′  ", "○  ", "         官鬼丑土", "″  ", "×  ", "         子孙卯木", "′应",
     "○应"],
    ["地水师 (坎宫,归魂)", "  父母酉金", "″应", "×应", "  兄弟亥水", "″  ", "×  ", "  官鬼丑土", "″  ", "×  ",
     "  妻财午火", "″世", "×世", "  官鬼辰土", "′  ", "○  ", "  子孙寅木", "″  ", "×  "],
    ["巽为风 (巽宫,六冲)", "  兄弟卯木", "′世", "○世", "  子孙巳火", "′  ", "○  ", "  妻财未土", "″  ", "×  ",
     "  官鬼酉金", "′应", "○应", "  父母亥水", "′  ", "○  ", "  妻财丑土", "″  ", "×  "],
    ["风天小畜 (巽宫)", "         兄弟卯木", "′  ", "○  ", "         子孙巳火", "′  ", "○  ", "         妻财未土",
     "″应", "×应", "官鬼酉金 妻财辰土", "′  ", "○  ", "         兄弟寅木", "′  ", "○  ", "         父母子水", "′世",
     "○世"],
    ["风火家人 (巽宫)", "         兄弟卯木", "′  ", "○  ", "         子孙巳火", "′应", "○应", "         妻财未土",
     "″  ", "×  ", "官鬼酉金 父母亥水", "′  ", "○  ", "         妻财丑土", "″世", "×世", "         兄弟卯木", "′  ",
     "○  "],
    ["风雷益 (巽宫)", "         兄弟卯木", "′应", "○应", "         子孙巳火", "′  ", "○  ", "         妻财未土", "″  ",
     "×  ", "官鬼酉金 妻财辰土", "″世", "×世", "         兄弟寅木", "″  ", "×  ", "         父母子水", "′  ", "○  "],
    ["天雷无妄 (巽宫,六冲)", "  妻财戌土", "′  ", "○  ", "  官鬼申金", "′  ", "○  ", "  子孙午火", "′世", "○世",
     "  妻财辰土", "″  ", "×  ", "  兄弟寅木", "″  ", "×  ", "  父母子水", "′应", "○应"],
    ["火雷噬嗑 (巽宫)", "  子孙巳火", "′  ", "○  ", "  妻财未土", "″世", "×世", "  官鬼酉金", "′  ", "○  ",
     "  妻财辰土", "″  ", "×  ", "  兄弟寅木", "″应", "×应", "  父母子水", "′  ", "○  "],
    ["山雷颐 (巽宫,游魂)", "         兄弟寅木", "′  ", "○  ", "子孙巳火 父母子水", "″  ", "×  ", "         妻财戌土",
     "″世", "×世", "官鬼酉金 妻财辰土", "″  ", "×  ", "         兄弟寅木", "″  ", "×  ", "         父母子水", "′应",
     "○应"],
    ["山风蛊 (巽宫,归魂)", "         兄弟寅木", "′应", "○应", "子孙巳火 父母子水", "″  ", "×  ", "         妻财戌土",
     "″  ", "×  ", "         官鬼酉金", "′世", "○世", "         父母亥水", "′  ", "○  ", "         妻财丑土", "″  ",
     "×  "],
    ["艮为山 (艮宫,六冲)", "  官鬼寅木", "′世", "○世", "  妻财子水", "″  ", "×  ", "  兄弟戌土", "″  ", "×  ",
     "  子孙申金", "′应", "○应", "  父母午火", "″  ", "×  ", "  兄弟辰土", "″  ", "×  "],
    ["山火贲 (艮宫,六合)", "         官鬼寅木", "′  ", "○  ", "         妻财子水", "″  ", "×  ", "         兄弟戌土",
     "″应", "×应", "子孙申金 妻财亥水", "′  ", "○  ", "父母午火 兄弟丑土", "″  ", "×  ", "         官鬼卯木", "′世",
     "○世"],
    ["山天大畜 (艮宫)", "         官鬼寅木", "′  ", "○  ", "         妻财子水", "″应", "×应", "         兄弟戌土",
     "″  ", "×  ", "子孙申金 兄弟辰土", "′  ", "○  ", "父母午火 官鬼寅木", "′世", "○世", "         妻财子水", "′  ",
     "○  "],
    ["山泽损 (艮宫)", "         官鬼寅木", "′应", "○应", "         妻财子水", "″  ", "×  ", "         兄弟戌土", "″  ",
     "×  ", "子孙申金 兄弟丑土", "″世", "×世", "         官鬼卯木", "′  ", "○  ", "         父母巳火", "′  ", "○  "],
    ["火泽睽 (艮宫)", "         父母巳火", "′  ", "○  ", "妻财子水 兄弟未土", "″  ", "×  ", "         子孙酉金", "′世",
     "○世", "         兄弟丑土", "″  ", "×  ", "         官鬼卯木", "′  ", "○  ", "         父母巳火", "′应", "○应"],
    ["天泽履 (艮宫)", "         兄弟戌土", "′  ", "○  ", "妻财子水 子孙申金", "′世", "○世", "         父母午火", "′  ",
     "○  ", "         兄弟丑土", "″  ", "×  ", "         官鬼卯木", "′应", "○应", "         父母巳火", "′  ", "○  "],
    ["风泽中孚 (艮宫,游魂)", "         官鬼卯木", "′  ", "○  ", "妻财子水 父母巳火", "′  ", "○  ", "         兄弟未土",
     "″世", "×世", "子孙申金 兄弟丑土", "″  ", "×  ", "         官鬼卯木", "′  ", "○  ", "         父母巳火", "′应",
     "○应"],
    ["风山渐 (艮宫,归魂)", "         官鬼卯木", "′应", "○应", "妻财子水 父母巳火", "′  ", "○  ", "         兄弟未土",
     "″  ", "×  ", "         子孙申金", "′世", "○世", "         父母午火", "″  ", "×  ", "         兄弟辰土", "″  ",
     "×  "],
    ["坤为地 (坤宫,六冲)", "  子孙酉金", "″世", "×世", "  妻财亥水", "″  ", "×  ", "  兄弟丑土", "″  ", "×  ",
     "  官鬼卯木", "″应", "×应", "  父母巳火", "″  ", "×  ", "  兄弟未土", "″  ", "×  "],
    ["地雷复 (坤宫,六合)", "         子孙酉金", "″  ", "×  ", "         妻财亥水", "″  ", "×  ", "         兄弟丑土",
     "″应", "×应", "         兄弟辰土", "″  ", "×  ", "父母巳火 官鬼寅木", "″  ", "×  ", "         妻财子水", "′世",
     "○世"],
    ["地泽临 (坤宫)", "  子孙酉金", "″  ", "×  ", "  妻财亥水", "″应", "×应", "  兄弟丑土", "″  ", "×  ", "  兄弟丑土",
     "″  ", "×  ", "  官鬼卯木", "′世", "○世", "  父母巳火", "′  ", "○  "],
    ["地天泰 (坤宫,六合)", "         子孙酉金", "″应", "×应", "         妻财亥水", "″  ", "×  ", "         兄弟丑土",
     "″  ", "×  ", "         兄弟辰土", "′世", "○世", "父母巳火 官鬼寅木", "′  ", "○  ", "         妻财子水", "′  ",
     "○  "],
    ["雷天大壮 (坤宫)", "  兄弟戌土", "″  ", "×  ", "  子孙申金", "″  ", "×  ", "  父母午火", "′世", "○世",
     "  兄弟辰土", "′  ", "○  ", "  官鬼寅木", "′  ", "○  ", "  妻财子水", "′应", "○应"],
    ["泽天夬 (坤宫)", "         兄弟未土", "″  ", "×  ", "         子孙酉金", "′世", "○世", "         妻财亥水", "′  ",
     "○  ", "         兄弟辰土", "′  ", "○  ", "父母巳火 官鬼寅木", "′应", "○应", "         妻财子水", "′  ", "○  "],
    ["水天需 (坤宫,游魂)", "         妻财子水", "″  ", "×  ", "         兄弟戌土", "′  ", "○  ", "         子孙申金",
     "″世", "×世", "         兄弟辰土", "′  ", "○  ", "父母巳火 官鬼寅木", "′  ", "○  ", "         妻财子水", "′应",
     "○应"],
    ["水地比 (坤宫,归魂)", "  妻财子水", "″应", "×应", "  兄弟戌土", "′  ", "○  ", "  子孙申金", "″  ", "×  ",
     "  官鬼卯木", "″世", "×世", "  父母巳火", "″  ", "×  ", "  兄弟未土", "″  ", "×  "],
    ["离为火 (离宫,六冲)", "  兄弟巳火", "′世", "○世", "  子孙未土", "″  ", "×  ", "  妻财酉金", "′  ", "○  ",
     "  官鬼亥水", "′应", "○应", "  子孙丑土", "″  ", "×  ", "  父母卯木", "′  ", "○  "],
    ["火山旅 (离宫,六合)", "         兄弟巳火", "′  ", "○  ", "         子孙未土", "″  ", "×  ", "         妻财酉金",
     "′ 应", "○应", "官鬼亥水 妻财申金", "′  ", "○  ", "         兄弟午火", "″  ", "×  ", "父母卯木 子孙辰土", "″世",
     "×世"],
    ["火风鼎 (离宫)", "         兄弟巳火", "′  ", "○  ", "         子孙未土", "″应", "×应", "         妻财酉金", "′  ",
     "○  ", "         妻财酉金", "′  ", "○  ", "         官鬼亥水", "′世", "○世", "父母卯木 子孙丑土", "″  ", "×  "],
    ["火水未济 (离宫)", "         兄弟巳火", "′ 应", "○ 应", "         子孙未土", "″  ", "×  ", "         妻财酉金",
     "′  ", "○  ", "官鬼亥水 兄弟午火", "″世", "×世", "         子孙辰土", "′  ", "○  ", "         父母寅木", "″  ",
     "×  "],
    ["山水蒙 (离宫)", "         父母寅木", "′  ", "○  ", "         官鬼子水", "″  ", "×  ", "妻财酉金 子孙戌土", "″世",
     "×世", "         兄弟午火", "″  ", "×  ", "         子孙辰土", "′  ", "○  ", "         父母寅木", "″应", "×应"],
    ["风水涣 (离宫)", "         父母卯木", "′  ", "○  ", "         兄弟巳火", "′世", "○世", "妻财酉金 子孙未土", "″  ",
     "×  ", "官鬼亥水 兄弟午火", "″  ", "×  ", "         子孙辰土", "′应", "○应", "         父母寅木", "″  ", "×  "],
    ["天水讼 (离宫,游魂)", "         子孙戌土", "′  ", "○  ", "         妻财申金", "′  ", "○  ", "         兄弟午火",
     "′世", "○世", "官鬼亥水 兄弟午火", "″  ", "×  ", "         子孙辰土", "′  ", "○  ", "         父母寅木", "″应",
     "×应"],
    ["天火同人 (离宫,归魂)", "  子孙戌土", "′应", "○应", "  妻财申金", "′  ", "○  ", "  兄弟午火", "′  ", "○  ",
     "  官鬼亥水", "′世", "○世", "  子孙丑土", "″  ", "×  ", "  父母卯木", "′  ", "○  "],
    ["兑为泽 (兑宫,六冲)", "  父母未土", "″世", "×世", "  兄弟酉金", "′  ", "○  ", "  子孙亥水", "′  ", "○  ",
     "  父母丑土", "″应", "×应", "  妻财卯木", "′  ", "○  ", "  官鬼巳火", "′  ", "○  "],
    ["泽水困 (兑宫,六合)", "  父母未土", "″  ", "×  ", "  兄弟酉金", "′  ", "○  ", "  子孙亥水", "′应", "○应",
     "  官鬼午火", "″  ", "×  ", "  父母辰土", "′  ", "○  ", "  妻财寅木", "″世", "×世"],
    ["泽地萃 (兑宫)", "  父母未土", "″  ", "×  ", "  兄弟酉金", "′应", "○应", "  子孙亥水", "′  ", "○  ", "  妻财卯木",
     "″  ", "×  ", "  官鬼巳火", "″世", "×世", "  父母未土", "″  ", "×  "],
    ["泽山咸 (兑宫)", "         父母未土", "″应", "×应", "         兄弟酉金", "′  ", "○  ", "         子孙亥水", "′  ",
     "○  ", "         兄弟申金", "′世", "○世", "妻财卯木 官鬼午火", "″  ", "×  ", "         父母辰土", "″  ", "×  "],
    ["水山蹇 (兑宫)", "         子孙子水", "″  ", "×  ", "         父母戌土", "′  ", "○  ", "         兄弟申金", "″世",
     "×世", "         兄弟申金", "′  ", "○  ", "妻财卯木 官鬼午火", "″  ", "×  ", "         父母辰土", "″应", "×应"],
    ["地山谦 (兑宫)", "         兄弟酉金", "″  ", "×  ", "         子孙亥水", "″世", "×世", "         父母丑土", "″  ",
     "×  ", "         兄弟申金", "′  ", "○  ", "妻财卯木 官鬼午火", "″应", "×应", "         父母辰土", "″  ", "×  "],
    ["雷山小过 (兑宫,游魂)", "         父母戌土", "″  ", "×  ", "         兄弟申金", "″  ", "×  ", "子孙亥水 官鬼午火",
     "′世", "○世", "         兄弟申金", "′  ", "○  ", "妻财卯木 官鬼午火", "″  ", "×  ", "         父母辰土", "″应",
     "×应"],
    ["雷泽归妹 (兑宫,归魂)", "         父母戌土", "″应", "×应", "         兄弟申金", "″  ", "×  ", "子孙亥水 官鬼午火",
     "′  ", "○  ", "         父母丑土", "″世", "×世", "         妻财卯木", "′  ", "○  ", "         官鬼巳火", "′  ",
     "○  "]
]
r_to_g = {
    (1, 1, 1, 1, 1, 1): 0, (1, 1, 1, 1, 1, 2): 1, (1, 1, 1, 1, 2, 2): 2, (1, 1, 1, 2, 2, 2): 3, (1, 1, 2, 2, 2, 2): 4,
    (1, 2, 2, 2, 2, 2): 5, (1, 2, 1, 2, 2, 2): 6, (1, 2, 1, 1, 1, 1): 7, (2, 2, 1, 2, 2, 1): 8, (2, 2, 1, 2, 2, 2): 9,
    (2, 2, 1, 2, 1, 2): 10, (2, 2, 1, 1, 1, 2): 11, (2, 2, 2, 1, 1, 2): 12, (2, 1, 2, 1, 1, 2): 13,
    (2, 1, 1, 1, 1, 2): 14, (2, 1, 1, 2, 2, 1): 15, (2, 1, 2, 2, 1, 2): 16, (2, 1, 2, 2, 1, 1): 17,
    (2, 1, 2, 2, 2, 1): 18, (2, 1, 2, 1, 2, 1): 19, (2, 1, 1, 1, 2, 1): 20, (2, 2, 1, 1, 2, 1): 21,
    (2, 2, 2, 1, 2, 1): 22, (2, 2, 2, 2, 1, 2): 23, (1, 1, 2, 1, 1, 2): 24, (1, 1, 2, 1, 1, 1): 25,
    (1, 1, 2, 1, 2, 1): 26, (1, 1, 2, 2, 2, 1): 27, (1, 1, 1, 2, 2, 1): 28, (1, 2, 1, 2, 2, 1): 29,
    (1, 2, 2, 2, 2, 1): 30, (1, 2, 2, 1, 1, 2): 31, (1, 2, 2, 1, 2, 2): 32, (1, 2, 2, 1, 2, 1): 33,
    (1, 2, 2, 1, 1, 1): 34, (1, 2, 2, 2, 1, 1): 35, (1, 2, 1, 2, 1, 1): 36, (1, 1, 1, 2, 1, 1): 37,
    (1, 1, 2, 2, 1, 1): 38, (1, 1, 2, 1, 2, 2): 39, (2, 2, 2, 2, 2, 2): 40, (2, 2, 2, 2, 2, 1): 41,
    (2, 2, 2, 2, 1, 1): 42, (2, 2, 2, 1, 1, 1): 43, (2, 2, 1, 1, 1, 1): 44, (2, 1, 1, 1, 1, 1): 45,
    (2, 1, 2, 1, 1, 1): 46, (2, 1, 2, 2, 2, 2): 47, (1, 2, 1, 1, 2, 1): 48, (1, 2, 1, 1, 2, 2): 49,
    (1, 2, 1, 1, 1, 2): 50, (1, 2, 1, 2, 1, 2): 51, (1, 2, 2, 2, 1, 2): 52, (1, 1, 2, 2, 1, 2): 53,
    (1, 1, 1, 2, 1, 2): 54, (1, 1, 1, 1, 2, 1): 55, (2, 1, 1, 2, 1, 1): 56, (2, 1, 1, 2, 1, 2): 57,
    (2, 1, 1, 2, 2, 2): 58, (2, 1, 1, 1, 2, 2): 59, (2, 1, 2, 1, 2, 2): 60, (2, 2, 2, 1, 2, 2): 61,
    (2, 2, 1, 1, 2, 2): 62, (2, 2, 1, 2, 1, 1): 63
    #  r6-r1 到 g 的映射关系
}
gua_name = ['乾为天', '天风姤', '天山遁', '天地否', '风地观', '山地剥', '火地晋', '火天大有', '震为雷', '雷地豫',
            '雷水解', '雷风恒', '地风升', '水风井', '泽风大过', '泽雷随', '坎为水', '水泽节', '水雷屯', '水火既济',
            '泽火革', '雷火丰', '地火明夷', '地水师', '巽为风', '风天小畜', '风火家人', '风雷益', '天雷无妄',
            '火雷噬嗑', '山雷颐', '山风蛊', '艮为山', '山火贲', '山天大畜', '山泽损', '火泽睽', '天泽履', '风泽中孚',
            '风山渐', '坤为地', '地雷复', '地泽临', '地天泰', '雷天大壮', '泽天夬', '水天需', '水地比', '离为火',
            '火山旅', '火风鼎', '火水未济', '山水蒙', '风水涣', '天水讼', '天火同人', '兑为泽', '泽水困', '泽地萃',
            '泽山咸', '水山蹇', '地山谦', '雷山小过', '雷泽归妹', '空白', '无']
biangua = [
    [["乾为天 (乾宫)", "  兄弟戌土′", "  子孙申金′", "  父母午火′", "  兄弟辰土′", "  官鬼寅木′", "  妻财子水′"],
     ["天风姤 (乾宫)", "  兄弟戌土′", "  子孙申金′", "  父母午火′", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″"],
     ["天山遁 (乾宫)", "  兄弟戌土′", "  子孙申金′", "  父母午火′", "  子孙申金′", "  父母午火″", "  兄弟辰土″"],
     ["天地否 (乾宫,六合)", "  兄弟戌土′", "  子孙申金′", "  父母午火′", "  官鬼卯木″", "  父母巳火″", "  兄弟未土″"],
     ["风地观 (乾宫)", "  官鬼卯木′", "  父母巳火′", "  兄弟未土″", "  官鬼卯木″", "  父母巳火″", "  兄弟未土″"],
     ["山地剥 (乾宫)", "  官鬼寅木′", "  妻财子水″", "  兄弟戌土″", "  官鬼卯木″", "  父母巳火″", "  兄弟未土″"],
     ["火地晋 (乾宫)", "  父母巳火′", "  兄弟未土″", "  子孙酉金′", "  官鬼卯木″", "  父母巳火″", "  兄弟未土″"],
     ["火天大有 (乾宫,归魂)", "  父母巳火′", "  兄弟未土″", "  子孙酉金′", "  兄弟辰土′", "  官鬼寅木′", "  妻财子水′"],
     ["震为雷 (震宫)", "  兄弟戌土″", "  子孙申金″", "  父母午火′", "  兄弟辰土″", "  官鬼寅木″", "  妻财子水′"],
     ["雷地豫 (震宫,六合)", "  兄弟戌土″", "  子孙申金″", "  父母午火′ ", "  官鬼卯木″", "  父母巳火″", "  兄弟未土″"],
     ["雷水解 (震宫)", "  兄弟戌土″", "  子孙申金″", "  父母午火′", "  父母午火″", "  兄弟辰土′", "  官鬼寅木″"],
     ["雷风恒 (震宫)", "  兄弟戌土″", "  子孙申金″", "  父母午火′", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″"],
     ["地风升 (震宫)", "  子孙酉金″", "  妻财亥水″", "  兄弟丑土″", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″"],
     ["水风井 (震宫)", "  妻财子水″", "  兄弟戌土′", "  子孙申金″", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″"],
     ["泽风大过 (震宫)", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″"],
     ["泽雷随 (震宫,归魂)", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  兄弟辰土″", "  官鬼寅木″", "  妻财子水′"],
     ["坎为水 (坎宫)", "  妻财子水″", "  兄弟戌土′", "  子孙申金″", "  父母午火″", "  兄弟辰土′", "  官鬼寅木″"],
     ["水泽节 (坎宫,六合)", "  妻财子水″", "  兄弟戌土′", "  子孙申金″", "  兄弟丑土″", "  官鬼卯木′", "  父母巳火′"],
     ["水雷屯 (坎宫)", "  妻财子水″", "  兄弟戌土′", "  子孙申金″", "  兄弟辰土″", "  官鬼寅木″", "  妻财子水′"],
     ["水火既济 (坎宫)", "  妻财子水″", "  兄弟戌土′", "  子孙申金″", "  妻财亥水′", "  兄弟丑土″", "  官鬼卯木′"],
     ["泽火革 (坎宫)", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  妻财亥水′", "  兄弟丑土″", "  官鬼卯木′"],
     ["雷火丰 (坎宫)", "  兄弟戌土″", "  子孙申金″", "  父母午火′", "  妻财亥水′", "  兄弟丑土″", "  官鬼卯木′"],
     ["地火明夷 (坎宫)", "  子孙酉金″", "  妻财亥水″", "  兄弟丑土″", "  妻财亥水′", "  兄弟丑土″", "  官鬼卯木′"],
     ["地水师 (坎宫,归魂)", "  子孙酉金″", "  妻财亥水″", "  兄弟丑土″", "  父母午火″", "  兄弟辰土′", "  官鬼寅木″"],
     ["巽为风 (巽宫)", "  官鬼卯木′", "  父母巳火′", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″"],
     ["风天小畜 (巽宫)", "  官鬼卯木′", "  父母巳火′", "  兄弟未土″", "  兄弟辰土′", "  官鬼寅木′", "  妻财子水′"],
     ["风火家人 (巽宫)", "  官鬼卯木′", "  父母巳火′", "  兄弟未土″", "  妻财亥水′", "  兄弟丑土″", "  官鬼卯木′"],
     ["风雷益 (巽宫)", "  官鬼卯木′", "  父母巳火′", "  兄弟未土″", "  兄弟辰土″", "  官鬼寅木″", "  妻财子水′"],
     ["天雷无妄 (巽宫)", "  兄弟戌土′", "  子孙申金′", "  父母午火′", "  兄弟辰土″", "  官鬼寅木″", "  妻财子水′"],
     ["火雷噬嗑 (巽宫)", "  父母巳火′", "  兄弟未土″", "  子孙酉金′", "  兄弟辰土″", "  官鬼寅木″", "  妻财子水′"],
     ["山雷颐 (巽宫)", "  官鬼寅木′", "  妻财子水″", "  兄弟戌土″", "  兄弟辰土″", "  官鬼寅木″", "  妻财子水′"],
     ["山风蛊 (巽宫,归魂)", "  官鬼寅木′", "  妻财子水″", "  兄弟戌土″", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″"],
     ["艮为山 (艮宫)", "  官鬼寅木′", "  妻财子水″", "  兄弟戌土″", "  子孙申金′", "  父母午火″", "  兄弟辰土″"],
     ["山火贲 (艮宫,六合)", "  官鬼寅木′", "  妻财子水″", "  兄弟戌土″", "  妻财亥水′", "  兄弟丑土″", "  官鬼卯木′"],
     ["山天大畜 (艮宫)", "  官鬼寅木′", "  妻财子水″", "  兄弟戌土″", "  兄弟辰土′", "  官鬼寅木′", "  妻财子水′"],
     ["山泽损 (艮宫)", "  官鬼寅木′", "  妻财子水″", "  兄弟戌土″", "  兄弟丑土″", "  官鬼卯木′", "  父母巳火′"],
     ["火泽睽 (艮宫)", "  父母巳火′", "  兄弟未土″", "  子孙酉金′", "  兄弟丑土″", "  官鬼卯木′", "  父母巳火′"],
     ["天泽履 (艮宫)", "  兄弟戌土′", "  子孙申金′", "  父母午火′", "  兄弟丑土″", "  官鬼卯木′", "  父母巳火′"],
     ["风泽中孚 (艮宫)", "  官鬼卯木′", "  父母巳火′", "  兄弟未土″", "  兄弟丑土″", "  官鬼卯木′", "  父母巳火′"],
     ["风山渐 (艮宫,归魂)", "  官鬼卯木′", "  父母巳火′", "  兄弟未土″", "  子孙申金′", "  父母午火″", "  兄弟辰土″"],
     ["坤为地 (坤宫)", "  子孙酉金″", "  妻财亥水″", "  兄弟丑土″", "  官鬼卯木″", "  父母巳火″", "  兄弟未土″"],
     ["地雷复 (坤宫,六合)", "  子孙酉金″", "  妻财亥水″", "  兄弟丑土″", "  兄弟辰土″", "  官鬼寅木″", "  妻财子水′"],
     ["地泽临 (坤宫)", "  子孙酉金″", "  妻财亥水″", "  兄弟丑土″", "  兄弟丑土″", "  官鬼卯木′", "  父母巳火′"],
     ["地天泰 (坤宫,六合)", "  子孙酉金″", "  妻财亥水″", "  兄弟丑土″", "  兄弟辰土′", "  官鬼寅木′", "  妻财子水′"],
     ["雷天大壮 (坤宫)", "  兄弟戌土″", "  子孙申金″", "  父母午火′", "  兄弟辰土′", "  官鬼寅木′", "  妻财子水′"],
     ["泽天夬 (坤宫)", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  兄弟辰土′", "  官鬼寅木′", "  妻财子水′"],
     ["水天需 (坤宫)", "  妻财子水″", "  兄弟戌土′", "  子孙申金″", "  兄弟辰土′", "  官鬼寅木′", "  妻财子水′"],
     ["水地比 (坤宫,归魂)", "  妻财子水″", "  兄弟戌土′", "  子孙申金″", "  官鬼卯木″", "  父母巳火″", "  兄弟未土″"],
     ["离为火 (离宫)", "  父母巳火′", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″", "  官鬼卯木′"],
     ["火山旅 (离宫,六合)", "  父母巳火′", "  兄弟未土″", "  子孙酉金′ ", "  子孙申金′", "  父母午火″", "  兄弟辰土″"],
     ["火风鼎 (离宫)", "  父母巳火′", "  兄弟未土″", "  子孙酉金′", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″"],
     ["火水未济 (离宫)", "  父母巳火′ ", "  兄弟未土″", "  子孙酉金′", "  父母午火″", "  兄弟辰土′", "  官鬼寅木″"],
     ["山水蒙 (离宫)", "  官鬼寅木′", "  妻财子水″", "  兄弟戌土″", "  父母午火″", "  兄弟辰土′", "  官鬼寅木″"],
     ["风水涣 (离宫)", "  官鬼卯木′", "  父母巳火′", "  兄弟未土″", "  父母午火″", "  兄弟辰土′", "  官鬼寅木″"],
     ["天水讼 (离宫)", "  兄弟戌土′", "  子孙申金′", "  父母午火′", "  父母午火″", "  兄弟辰土′", "  官鬼寅木″"],
     ["天火同人 (离宫,归魂)", "  兄弟戌土′", "  子孙申金′", "  父母午火′", "  妻财亥水′", "  兄弟丑土″", "  官鬼卯木′"],
     ["兑为泽 (兑宫)", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  兄弟丑土″", "  官鬼卯木′", "  父母巳火′"],
     ["泽水困 (兑宫,六合)", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  父母午火″", "  兄弟辰土′", "  官鬼寅木″"],
     ["泽地萃 (兑宫)", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  官鬼卯木″", "  父母巳火″", "  兄弟未土″"],
     ["泽山咸 (兑宫)", "  兄弟未土″", "  子孙酉金′", "  妻财亥水′", "  子孙申金′", "  父母午火″", "  兄弟辰土″"],
     ["水山蹇 (兑宫)", "  妻财子水″", "  兄弟戌土′", "  子孙申金″", "  子孙申金′", "  父母午火″", "  兄弟辰土″"],
     ["地山谦 (兑宫)", "  子孙酉金″", "  妻财亥水″", "  兄弟丑土″", "  子孙申金′", "  父母午火″", "  兄弟辰土″"],
     ["雷山小过 (兑宫)", "  兄弟戌土″", "  子孙申金″", "  父母午火′", "  子孙申金′", "  父母午火″", "  兄弟辰土″"],
     ["雷泽归妹 (兑宫,归魂)", "  兄弟戌土″", "  子孙申金″", "  父母午火′", "  兄弟丑土″", "  官鬼卯木′",
      "  父母巳火′"]],  # guagong1
    [["乾为天 (乾宫)", "  官鬼戌土′", "  父母申金′", "  妻财午火′", "  官鬼辰土′", "  子孙寅木′", "  兄弟子水′"],
     ["天风姤 (乾宫)", "  官鬼戌土′", "  父母申金′", "  妻财午火′", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″"],
     ["天山遁 (乾宫)", "  官鬼戌土′", "  父母申金′", "  妻财午火′", "  父母申金′", "  妻财午火″", "  官鬼辰土″"],
     ["天地否 (乾宫)", "  官鬼戌土′", "  父母申金′", "  妻财午火′", "  子孙卯木″", "  妻财巳火″", "  官鬼未土″"],
     ["风地观 (乾宫)", "  子孙卯木′", "  妻财巳火′", "  官鬼未土″", "  子孙卯木″", "  妻财巳火″", "  官鬼未土″"],
     ["山地剥 (乾宫)", "  子孙寅木′", "  兄弟子水″", "  官鬼戌土″", "  子孙卯木″", "  妻财巳火″", "  官鬼未土″"],
     ["火地晋 (乾宫)", "  妻财巳火′", "  官鬼未土″", "  父母酉金′", "  子孙卯木″", "  妻财巳火″", "  官鬼未土″"],
     ["火天大有 (乾宫,归魂)", "  妻财巳火′", "  官鬼未土″", "  父母酉金′", "  官鬼辰土′", "  子孙寅木′", "  兄弟子水′"],
     ["震为雷 (震宫)", "  官鬼戌土″", "  父母申金″", "  妻财午火′", "  官鬼辰土″", "  子孙寅木″", "  兄弟子水′"],
     ["雷地豫 (震宫)", "  官鬼戌土″", "  父母申金″", "  妻财午火′ ", "  子孙卯木″", "  妻财巳火″", "  官鬼未土″"],
     ["雷水解 (震宫)", "  官鬼戌土″", "  父母申金″", "  妻财午火′", "  妻财午火″", "  官鬼辰土′", "  子孙寅木″"],
     ["雷风恒 (震宫)", "  官鬼戌土″", "  父母申金″", "  妻财午火′", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″"],
     ["地风升 (震宫)", "  父母酉金″", "  兄弟亥水″", "  官鬼丑土″", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″"],
     ["水风井 (震宫)", "  兄弟子水″", "  官鬼戌土′", "  父母申金″", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″"],
     ["泽风大过 (震宫)", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″"],
     ["泽雷随 (震宫,归魂)", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  官鬼辰土″", "  子孙寅木″", "  兄弟子水′"],
     ["坎为水 (坎宫)", "  兄弟子水″", "  官鬼戌土′", "  父母申金″", "  妻财午火″", "	  官鬼辰土′", "  子孙寅木″"],
     ["水泽节 (坎宫)", "  兄弟子水″", "  官鬼戌土′", "  父母申金″", "  官鬼丑土″", "  子孙卯木′", "  妻财巳火′"],
     ["水雷屯 (坎宫)", "  兄弟子水″", "  官鬼戌土′", "  父母申金″", "  官鬼辰土″", "  子孙寅木″", "  兄弟子水′"],
     ["水火既济 (坎宫)", "  兄弟子水″", "  官鬼戌土′", "  父母申金″", "  兄弟亥水′", "  官鬼丑土″", "  子孙卯木′"],
     ["泽火革 (坎宫)", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  兄弟亥水′", "  官鬼丑土″", "  子孙卯木′"],
     ["雷火丰 (坎宫)", "  官鬼戌土″", "  父母申金″", "  妻财午火′", "  兄弟亥水′", "  官鬼丑土″", "  子孙卯木′"],
     ["地火明夷 (坎宫)", "  父母酉金″", "  兄弟亥水″", "  官鬼丑土″", "  兄弟亥水′", "  官鬼丑土″", "  子孙卯木′"],
     ["地水师 (坎宫,归魂)", "  父母酉金″", "  兄弟亥水″", "  官鬼丑土″", "  妻财午火″", "  官鬼辰土′", "  子孙寅木″"],
     ["巽为风 (巽宫)", "  子孙卯木′", "  妻财巳火′", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″"],
     ["风天小畜 (巽宫)", "  子孙卯木′", "  妻财巳火′", "  官鬼未土″", "  官鬼辰土′", "  子孙寅木′", "  兄弟子水′"],
     ["风火家人 (巽宫)", "  子孙卯木′", "  妻财巳火′", "  官鬼未土″", "  兄弟亥水′", "  官鬼丑土″", "  子孙卯木′"],
     ["风雷益 (巽宫)", "  子孙卯木′", "  妻财巳火′", "  官鬼未土″", "  官鬼辰土″", "  子孙寅木″", "  兄弟子水′"],
     ["天雷无妄 (巽宫)", "  官鬼戌土′", "  父母申金′", "  妻财午火′", "  官鬼辰土″", "  子孙寅木″", "  兄弟子水′"],
     ["火雷噬嗑 (巽宫)", "  妻财巳火′", "  官鬼未土″", "  父母酉金′", "  官鬼辰土″", "  子孙寅木″", "  兄弟子水′"],
     ["山雷颐 (巽宫)", "  子孙寅木′", "  兄弟子水″", "  官鬼戌土″", "  官鬼辰土″", "  子孙寅木″", "  兄弟子水′"],
     ["山风蛊 (巽宫,归魂)", "  子孙寅木′", "  兄弟子水″", "  官鬼戌土″", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″"],
     ["艮为山 (艮宫)", "  子孙寅木′", "  兄弟子水″", "  官鬼戌土″", "  父母申金′", "  妻财午火″", "  官鬼辰土″"],
     ["山火贲 (艮宫)", "  子孙寅木′", "  兄弟子水″", "  官鬼戌土″", "  兄弟亥水′", "  官鬼丑土″", "  子孙卯木′"],
     ["山天大畜 (艮宫)", "  子孙寅木′", "  兄弟子水″", "  官鬼戌土″", "  官鬼辰土′", "  子孙寅木′", "  兄弟子水′"],
     ["山泽损 (艮宫)", "  子孙寅木′", "  兄弟子水″", "  官鬼戌土″", "  官鬼丑土″", "  子孙卯木′", "  妻财巳火′"],
     ["火泽睽 (艮宫)", "  妻财巳火′", "  官鬼未土″", "  父母酉金′", "  官鬼丑土″", "  子孙卯木′", "  妻财巳火′"],
     ["天泽履 (艮宫)", "  官鬼戌土′", "  父母申金′", "  妻财午火′", "  官鬼丑土″", "  子孙卯木′", "  妻财巳火′"],
     ["风泽中孚 (艮宫)", "  子孙卯木′", "  妻财巳火′", "  官鬼未土″", "  官鬼丑土″", "  子孙卯木′", "  妻财巳火′"],
     ["风山渐 (艮宫,归魂)", "  子孙卯木′", "  妻财巳火′", "  官鬼未土″", "  父母申金′", "  妻财午火″", "  官鬼辰土″"],
     ["坤为地 (坤宫)", "  父母酉金″", "  兄弟亥水″", "  官鬼丑土″", "  子孙卯木″", "  妻财巳火″", "  官鬼未土″"],
     ["地雷复 (坤宫)", "  父母酉金″", "  兄弟亥水″", "  官鬼丑土″", "  官鬼辰土″", "  子孙寅木″", "  兄弟子水′"],
     ["地泽临 (坤宫)", "  父母酉金″", "  兄弟亥水″", "  官鬼丑土″", "  官鬼丑土″", "  子孙卯木′", "  妻财巳火′"],
     ["地天泰 (坤宫)", "  父母酉金″", "  兄弟亥水″", "  官鬼丑土″", "  官鬼辰土′", "  子孙寅木′", "  兄弟子水′"],
     ["雷天大壮 (坤宫)", "  官鬼戌土″", "  父母申金″", "  妻财午火′", "  官鬼辰土′", "  子孙寅木′", "  兄弟子水′"],
     ["泽天夬 (坤宫)", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  官鬼辰土′", "  子孙寅木′", "  兄弟子水′"],
     ["水天需 (坤宫)", "  兄弟子水″", "  官鬼戌土′", "  父母申金″", "  官鬼辰土′", "  子孙寅木′", "  兄弟子水′"],
     ["水地比 (坤宫,归魂)", "  兄弟子水″", "  官鬼戌土′", "  父母申金″", "  子孙卯木″", "  妻财巳火″", "  官鬼未土″"],
     ["离为火 (离宫)", "  妻财巳火′", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″", "  子孙卯木′"],
     ["火山旅 (离宫)", "  妻财巳火′", "  官鬼未土″", "  父母酉金′ ", "  父母申金′", "  妻财午火″", "  官鬼辰土″"],
     ["火风鼎 (离宫)", "  妻财巳火′", "  官鬼未土″", "  父母酉金′", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″"],
     ["火水未济 (离宫)", "  妻财巳火′ ", "  官鬼未土″", "  父母酉金′", "  妻财午火″", "  官鬼辰土′", "  子孙寅木″"],
     ["山水蒙 (离宫)", "  子孙寅木′", "  兄弟子水″", "  官鬼戌土″", "  妻财午火″", "  官鬼辰土′", "  子孙寅木″"],
     ["风水涣 (离宫)", "  子孙卯木′", "  妻财巳火′", "  官鬼未土″", "  妻财午火″", "  官鬼辰土′", "  子孙寅木″"],
     ["天水讼 (离宫)", "  官鬼戌土′", "  父母申金′", "  妻财午火′", "  妻财午火″", "  官鬼辰土′", "  子孙寅木″"],
     ["天火同人 (离宫,归魂)", "  官鬼戌土′", "  父母申金′", "  妻财午火′", "  兄弟亥水′", "  官鬼丑土″", "  子孙卯木′"],
     ["兑为泽 (兑宫)", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  官鬼丑土″", "  子孙卯木′", "  妻财巳火′"],
     ["泽水困 (兑宫)", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  妻财午火″", "  官鬼辰土′", "  子孙寅木″"],
     ["泽地萃 (兑宫)", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  子孙卯木″", "  妻财巳火″", "  官鬼未土″"],
     ["泽山咸 (兑宫)", "  官鬼未土″", "  父母酉金′", "  兄弟亥水′", "  父母申金′", "  妻财午火″", "  官鬼辰土″"],
     ["水山蹇 (兑宫)", "  兄弟子水″", "  官鬼戌土′", "  父母申金″", "  父母申金′", "  妻财午火″", "  官鬼辰土″"],
     ["地山谦 (兑宫)", "  父母酉金″", "  兄弟亥水″", "  官鬼丑土″", "  父母申金′", "  妻财午火″", "  官鬼辰土″"],
     ["雷山小过 (兑宫)", "  官鬼戌土″", "  父母申金″", "  妻财午火′", "  父母申金′", "  妻财午火″", "  官鬼辰土″"],
     ["雷泽归妹 (兑宫,归魂)", "  官鬼戌土″", "  父母申金″", "  妻财午火′", "  官鬼丑土″", "  子孙卯木′",
      "  妻财巳火′"]],  # guagong2
    [["乾为天 (乾宫)", "  子孙戌土′", "  妻财申金′", "  兄弟午火′", "  子孙辰土′", "  父母寅木′", "  官鬼子水′"],
     ["天风姤 (乾宫)", "  子孙戌土′", "  妻财申金′", "  兄弟午火′", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″"],
     ["天山遁 (乾宫)", "  子孙戌土′", "  妻财申金′", "  兄弟午火′", "  妻财申金′", "  兄弟午火″", "  子孙辰土″"],
     ["天地否 (乾宫)", "  子孙戌土′", "  妻财申金′", "  兄弟午火′", "  父母卯木″", "  兄弟巳火″", "  子孙未土″"],
     ["风地观 (乾宫)", "  父母卯木′", "  兄弟巳火′", "  子孙未土″", "  父母卯木″", "  兄弟巳火″", "  子孙未土″"],
     ["山地剥 (乾宫)", "  父母寅木′", "  官鬼子水″", "  子孙戌土″", "  父母卯木″", "  兄弟巳火″", "  子孙未土″"],
     ["火地晋 (乾宫)", "  兄弟巳火′", "  子孙未土″", "  妻财酉金′", "  父母卯木″", "  兄弟巳火″", "  子孙未土″"],
     ["火天大有 (乾宫,归魂)", "  兄弟巳火′", "  子孙未土″", "  妻财酉金′", "  子孙辰土′", "  父母寅木′", "  官鬼子水′"],
     ["震为雷 (震宫)", "  子孙戌土″", "  妻财申金″", "  兄弟午火′", "  子孙辰土″", "  父母寅木″", "  官鬼子水′"],
     ["雷地豫 (震宫)", "  子孙戌土″", "  妻财申金″", "  兄弟午火′ ", "  父母卯木″", "  兄弟巳火″", "  子孙未土″"],
     ["雷水解 (震宫)", "  子孙戌土″", "  妻财申金″", "  兄弟午火′", "  兄弟午火″", "  子孙辰土′", "  父母寅木″"],
     ["雷风恒 (震宫)", "  子孙戌土″", "  妻财申金″", "  兄弟午火′", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″"],
     ["地风升 (震宫)", "  妻财酉金″", "  官鬼亥水″", "  子孙丑土″", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″"],
     ["水风井 (震宫)", "  官鬼子水″", "  子孙戌土′", "  妻财申金″", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″"],
     ["泽风大过 (震宫)", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″"],
     ["泽雷随 (震宫,归魂)", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  子孙辰土″", "  父母寅木″", "  官鬼子水′"],
     ["坎为水 (坎宫)", "  官鬼子水″", "  子孙戌土′", "  妻财申金″", "  兄弟午火″", "  子孙辰土′", "  父母寅木″"],
     ["水泽节 (坎宫)", "  官鬼子水″", "  子孙戌土′", "  妻财申金″", "  子孙丑土″", "  父母卯木′", "  兄弟巳火′"],
     ["水雷屯 (坎宫)", "  官鬼子水″", "  子孙戌土′", "  妻财申金″", "  子孙辰土″", "  父母寅木″", "  官鬼子水′"],
     ["水火既济 (坎宫)", "  官鬼子水″", "  子孙戌土′", "  妻财申金″", "  官鬼亥水′", "  子孙丑土″", "  父母卯木′"],
     ["泽火革 (坎宫)", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  官鬼亥水′", "  子孙丑土″", "  父母卯木′"],
     ["雷火丰 (坎宫)", "  子孙戌土″", "  妻财申金″", "  兄弟午火′", "  官鬼亥水′", "  子孙丑土″", "  父母卯木′"],
     ["地火明夷 (坎宫)", "  妻财酉金″", "  官鬼亥水″", "  子孙丑土″", "  官鬼亥水′", "  子孙丑土″", "  父母卯木′"],
     ["地水师 (坎宫,归魂)", "  妻财酉金″", "  官鬼亥水″", "  子孙丑土″", "  兄弟午火″", "  子孙辰土′", "  父母寅木″"],
     ["巽为风 (巽宫)", "  父母卯木′", "  兄弟巳火′", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″"],
     ["风天小畜 (巽宫)", "  父母卯木′", "  兄弟巳火′", "  子孙未土″", "  子孙辰土′", "  父母寅木′", "  官鬼子水′"],
     ["风火家人 (巽宫)", "  父母卯木′", "  兄弟巳火′", "  子孙未土″", "  官鬼亥水′", "  子孙丑土″", "  父母卯木′"],
     ["风雷益 (巽宫)", "  父母卯木′", "  兄弟巳火′", "  子孙未土″", "  子孙辰土″", "  父母寅木″", "  官鬼子水′"],
     ["天雷无妄 (巽宫)", "  子孙戌土′", "  妻财申金′", "  兄弟午火′", "  子孙辰土″", "  父母寅木″", "  官鬼子水′"],
     ["火雷噬嗑 (巽宫)", "  兄弟巳火′", "  子孙未土″", "  妻财酉金′", "  子孙辰土″", "  父母寅木″", "  官鬼子水′"],
     ["山雷颐 (巽宫)", "  父母寅木′", "  官鬼子水″", "  子孙戌土″", "  子孙辰土″", "  父母寅木″", "  官鬼子水′"],
     ["山风蛊 (巽宫,归魂)", "  父母寅木′", "  官鬼子水″", "  子孙戌土″", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″"],
     ["艮为山 (艮宫)", "  父母寅木′", "  官鬼子水″", "  子孙戌土″", "  妻财申金′", "  兄弟午火″", "  子孙辰土″"],
     ["山火贲 (艮宫)", "  父母寅木′", "  官鬼子水″", "  子孙戌土″", "  官鬼亥水′", "  子孙丑土″", "  父母卯木′"],
     ["山天大畜 (艮宫)", "  父母寅木′", "  官鬼子水″", "  子孙戌土″", "  子孙辰土′", "  父母寅木′", "  官鬼子水′"],
     ["山泽损 (艮宫)", "  父母寅木′", "  官鬼子水″", "  子孙戌土″", "  子孙丑土″", "  父母卯木′", "  兄弟巳火′"],
     ["火泽睽 (艮宫)", "  兄弟巳火′", "  子孙未土″", "  妻财酉金′", "  子孙丑土″", "  父母卯木′", "  兄弟巳火′"],
     ["天泽履 (艮宫)", "  子孙戌土′", "  妻财申金′", "  兄弟午火′", "  子孙丑土″", "  父母卯木′", "  兄弟巳火′"],
     ["风泽中孚 (艮宫)", "  父母卯木′", "  兄弟巳火′", "  子孙未土″", "  子孙丑土″", "  父母卯木′", "  兄弟巳火′"],
     ["风山渐 (艮宫,归魂)", "  父母卯木′", "  兄弟巳火′", "  子孙未土″", "  妻财申金′", "  兄弟午火″", "  子孙辰土″"],
     ["坤为地 (坤宫)", "  妻财酉金″", "  官鬼亥水″", "  子孙丑土″", "  父母卯木″", "  兄弟巳火″", "  子孙未土″"],
     ["地雷复 (坤宫)", "  妻财酉金″", "  官鬼亥水″", "  子孙丑土″", "  子孙辰土″", "  父母寅木″", "  官鬼子水′"],
     ["地泽临 (坤宫)", "  妻财酉金″", "  官鬼亥水″", "  子孙丑土″", "  子孙丑土″", "  父母卯木′", "  兄弟巳火′"],
     ["地天泰 (坤宫)", "  妻财酉金″", "  官鬼亥水″", "  子孙丑土″", "  子孙辰土′", "  父母寅木′", "  官鬼子水′"],
     ["雷天大壮 (坤宫)", "  子孙戌土″", "  妻财申金″", "  兄弟午火′", "  子孙辰土′", "  父母寅木′", "  官鬼子水′"],
     ["泽天夬 (坤宫)", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  子孙辰土′", "  父母寅木′", "  官鬼子水′"],
     ["水天需 (坤宫)", "  官鬼子水″", "  子孙戌土′", "  妻财申金″", "  子孙辰土′", "  父母寅木′", "  官鬼子水′"],
     ["水地比 (坤宫,归魂)", "  官鬼子水″", "  子孙戌土′", "  妻财申金″", "  父母卯木″", "  兄弟巳火″", "  子孙未土″"],
     ["离为火 (离宫)", "  兄弟巳火′", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″", "  父母卯木′"],
     ["火山旅 (离宫)", "  兄弟巳火′", "  子孙未土″", "  妻财酉金′ ", "  妻财申金′", "  兄弟午火″", "  子孙辰土″"],
     ["火风鼎 (离宫)", "  兄弟巳火′", "  子孙未土″", "  妻财酉金′", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″"],
     ["火水未济 (离宫)", "  兄弟巳火′ ", "  子孙未土″", "  妻财酉金′", "  兄弟午火″", "  子孙辰土′", "  父母寅木″"],
     ["山水蒙 (离宫)", "  父母寅木′", "  官鬼子水″", "  子孙戌土″", "  兄弟午火″", "  子孙辰土′", "  父母寅木″"],
     ["风水涣 (离宫)", "  父母卯木′", "  兄弟巳火′", "  子孙未土″", "  兄弟午火″", "  子孙辰土′", "  父母寅木″"],
     ["天水讼 (离宫)", "  子孙戌土′", "  妻财申金′", "  兄弟午火′", "  兄弟午火″", "  子孙辰土′", "  父母寅木″"],
     ["天火同人 (离宫,归魂)", "  子孙戌土′", "  妻财申金′", "  兄弟午火′", "  官鬼亥水′", "  子孙丑土″", "  父母卯木′"],
     ["兑为泽 (兑宫)", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  子孙丑土″", "  父母卯木′", "  兄弟巳火′"],
     ["泽水困 (兑宫)", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  兄弟午火″", "  子孙辰土′", "  父母寅木″"],
     ["泽地萃 (兑宫)", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  父母卯木″", "  兄弟巳火″", "  子孙未土″"],
     ["泽山咸 (兑宫)", "  子孙未土″", "  妻财酉金′", "  官鬼亥水′", "  妻财申金′", "  兄弟午火″", "  子孙辰土″"],
     ["水山蹇 (兑宫)", "  官鬼子水″", "  子孙戌土′", "  妻财申金″", "  妻财申金′", "  兄弟午火″", "  子孙辰土″"],
     ["地山谦 (兑宫)", "  妻财酉金″", "  官鬼亥水″", "  子孙丑土″", "  妻财申金′", "  兄弟午火″", "  子孙辰土″"],
     ["雷山小过 (兑宫)", "  子孙戌土″", "  妻财申金″", "  兄弟午火′", "  妻财申金′", "  兄弟午火″", "  子孙辰土″"],
     ["雷泽归妹 (兑宫,归魂)", "  子孙戌土″", "  妻财申金″", "  兄弟午火′", "  子孙丑土″", "  父母卯木′",
      "  兄弟巳火′"]],  # guagong3
    [["乾为天 (乾宫)", "  妻财戌土′", "  官鬼申金′", "  子孙午火′", "  妻财辰土′", "  兄弟寅木′", "  父母子水′"],
     ["天风姤 (乾宫)", "  妻财戌土′", "  官鬼申金′", "  子孙午火′", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″"],
     ["天山遁 (乾宫)", "  妻财戌土′", "  官鬼申金′", "  子孙午火′", "  官鬼申金′", "  子孙午火″", "  妻财辰土″"],
     ["天地否 (乾宫)", "  妻财戌土′", "  官鬼申金′", "  子孙午火′", "  兄弟卯木″", "  子孙巳火″", "  妻财未土″"],
     ["风地观 (乾宫)", "  兄弟卯木′", "  子孙巳火′", "  妻财未土″", "  兄弟卯木″", "  子孙巳火″", "  妻财未土″"],
     ["山地剥 (乾宫)", "  兄弟寅木′", "  父母子水″", "  妻财戌土″", "  兄弟卯木″", "  子孙巳火″", "  妻财未土″"],
     ["火地晋 (乾宫)", "  子孙巳火′", "  妻财未土″", "  官鬼酉金′", "  兄弟卯木″", "  子孙巳火″", "  妻财未土″"],
     ["火天大有 (乾宫,归魂)", "  子孙巳火′", "  妻财未土″", "  官鬼酉金′", "  妻财辰土′", "  兄弟寅木′", "  父母子水′"],
     ["震为雷 (震宫)", "  妻财戌土″", "  官鬼申金″", "  子孙午火′", "  妻财辰土″", "  兄弟寅木″", "  父母子水′"],
     ["雷地豫 (震宫)", "  妻财戌土″", "  官鬼申金″", "  子孙午火′ ", "  兄弟卯木″", "  子孙巳火″", "  妻财未土″"],
     ["雷水解 (震宫)", "  妻财戌土″", "  官鬼申金″", "  子孙午火′", "  子孙午火″", "  妻财辰土′", "  兄弟寅木″"],
     ["雷风恒 (震宫)", "  妻财戌土″", "  官鬼申金″", "  子孙午火′", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″"],
     ["地风升 (震宫)", "  官鬼酉金″", "  父母亥水″", "  妻财丑土″", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″"],
     ["水风井 (震宫)", "  父母子水″", "  妻财戌土′", "  官鬼申金″", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″"],
     ["泽风大过 (震宫)", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″"],
     ["泽雷随 (震宫,归魂)", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  妻财辰土″", "  兄弟寅木″", "  父母子水′"],
     ["坎为水 (坎宫)", "  父母子水″", "  妻财戌土′", "  官鬼申金″", "  子孙午火″", "  妻财辰土′", "  兄弟寅木″"],
     ["水泽节 (坎宫)", "  父母子水″", "  妻财戌土′", "  官鬼申金″", "  妻财丑土″", "  兄弟卯木′", "  子孙巳火′"],
     ["水雷屯 (坎宫)", "  父母子水″", "  妻财戌土′", "  官鬼申金″", "  妻财辰土″", "  兄弟寅木″", "  父母子水′"],
     ["水火既济 (坎宫)", "  父母子水″", "  妻财戌土′", "  官鬼申金″", "  父母亥水′", "  妻财丑土″", "  兄弟卯木′"],
     ["泽火革 (坎宫)", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  父母亥水′", "  妻财丑土″", "  兄弟卯木′"],
     ["雷火丰 (坎宫)", "  妻财戌土″", "  官鬼申金″", "  子孙午火′", "  父母亥水′", "  妻财丑土″", "  兄弟卯木′"],
     ["地火明夷 (坎宫)", "  官鬼酉金″", "  父母亥水″", "  妻财丑土″", "  父母亥水′", "  妻财丑土″", "  兄弟卯木′"],
     ["地水师 (坎宫,归魂)", "  官鬼酉金″", "  父母亥水″", "  妻财丑土″", "  子孙午火″", "  妻财辰土′", "  兄弟寅木″"],
     ["巽为风 (巽宫)", "  兄弟卯木′", "  子孙巳火′", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″"],
     ["风天小畜 (巽宫)", "  兄弟卯木′", "  子孙巳火′", "  妻财未土″", "  妻财辰土′", "  兄弟寅木′", "  父母子水′"],
     ["风火家人 (巽宫)", "  兄弟卯木′", "  子孙巳火′", "  妻财未土″", "  父母亥水′", "  妻财丑土″", "  兄弟卯木′"],
     ["风雷益 (巽宫)", "  兄弟卯木′", "  子孙巳火′", "  妻财未土″", "  妻财辰土″", "  兄弟寅木″", "  父母子水′"],
     ["天雷无妄 (巽宫)", "  妻财戌土′", "  官鬼申金′", "  子孙午火′", "  妻财辰土″", "  兄弟寅木″", "  父母子水′"],
     ["火雷噬嗑 (巽宫)", "  子孙巳火′", "  妻财未土″", "  官鬼酉金′", "  妻财辰土″", "  兄弟寅木″", "  父母子水′"],
     ["山雷颐 (巽宫)", "  兄弟寅木′", "  父母子水″", "  妻财戌土″", "  妻财辰土″", "  兄弟寅木″", "  父母子水′"],
     ["山风蛊 (巽宫,归魂)", "  兄弟寅木′", "  父母子水″", "  妻财戌土″", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″"],
     ["艮为山 (艮宫)", "  兄弟寅木′", "  父母子水″", "  妻财戌土″", "  官鬼申金′", "  子孙午火″", "  妻财辰土″"],
     ["山火贲 (艮宫)", "  兄弟寅木′", "  父母子水″", "  妻财戌土″", "  父母亥水′", "  妻财丑土″", "  兄弟卯木′"],
     ["山天大畜 (艮宫)", "  兄弟寅木′", "  父母子水″", "  妻财戌土″", "  妻财辰土′", "  兄弟寅木′", "  父母子水′"],
     ["山泽损 (艮宫)", "  兄弟寅木′", "  父母子水″", "  妻财戌土″", "  妻财丑土″", "  兄弟卯木′", "  子孙巳火′"],
     ["火泽睽 (艮宫)", "  子孙巳火′", "  妻财未土″", "  官鬼酉金′", "  妻财丑土″", "  兄弟卯木′", "  子孙巳火′"],
     ["天泽履 (艮宫)", "  妻财戌土′", "  官鬼申金′", "  子孙午火′", "  妻财丑土″", "  兄弟卯木′", "  子孙巳火′"],
     ["风泽中孚 (艮宫)", "  兄弟卯木′", "  子孙巳火′", "  妻财未土″", "  妻财丑土″", "  兄弟卯木′", "  子孙巳火′"],
     ["风山渐 (艮宫,归魂)", "  兄弟卯木′", "  子孙巳火′", "  妻财未土″", "  官鬼申金′", "  子孙午火″", "  妻财辰土″"],
     ["坤为地 (坤宫)", "  官鬼酉金″", "  父母亥水″", "  妻财丑土″", "  兄弟卯木″", "  子孙巳火″", "  妻财未土″"],
     ["地雷复 (坤宫)", "  官鬼酉金″", "  父母亥水″", "  妻财丑土″", "  妻财辰土″", "  兄弟寅木″", "  父母子水′"],
     ["地泽临 (坤宫)", "  官鬼酉金″", "  父母亥水″", "  妻财丑土″", "  妻财丑土″", "  兄弟卯木′", "  子孙巳火′"],
     ["地天泰 (坤宫)", "  官鬼酉金″", "  父母亥水″", "  妻财丑土″", "  妻财辰土′", "  兄弟寅木′", "  父母子水′"],
     ["雷天大壮 (坤宫)", "  妻财戌土″", "  官鬼申金″", "  子孙午火′", "  妻财辰土′", "  兄弟寅木′", "  父母子水′"],
     ["泽天夬 (坤宫)", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  妻财辰土′", "  兄弟寅木′", "  父母子水′"],
     ["水天需 (坤宫)", "  父母子水″", "  妻财戌土′", "  官鬼申金″", "  妻财辰土′", "  兄弟寅木′", "  父母子水′"],
     ["水地比 (坤宫,归魂)", "  父母子水″", "  妻财戌土′", "  官鬼申金″", "  兄弟卯木″", "  子孙巳火″", "  妻财未土″"],
     ["离为火 (离宫)", "  子孙巳火′", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″", "  兄弟卯木′"],
     ["火山旅 (离宫)", "  子孙巳火′", "  妻财未土″", "  官鬼酉金′ ", "  官鬼申金′", "  子孙午火″", "  妻财辰土″"],
     ["火风鼎 (离宫)", "  子孙巳火′", "  妻财未土″", "  官鬼酉金′", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″"],
     ["火水未济 (离宫)", "  子孙巳火′ ", "  妻财未土″", "  官鬼酉金′", "  子孙午火″", "  妻财辰土′", "  兄弟寅木″"],
     ["山水蒙 (离宫)", "  兄弟寅木′", "  父母子水″", "  妻财戌土″", "  子孙午火″", "  妻财辰土′", "  兄弟寅木″"],
     ["风水涣 (离宫)", "  兄弟卯木′", "  子孙巳火′", "  妻财未土″", "  子孙午火″", "  妻财辰土′", "  兄弟寅木″"],
     ["天水讼 (离宫)", "  妻财戌土′", "  官鬼申金′", "  子孙午火′", "  子孙午火″", "  妻财辰土′", "  兄弟寅木″"],
     ["天火同人 (离宫,归魂)", "  妻财戌土′", "  官鬼申金′", "  子孙午火′", "  父母亥水′", "  妻财丑土″", "  兄弟卯木′"],
     ["兑为泽 (兑宫)", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  妻财丑土″", "  兄弟卯木′", "  子孙巳火′"],
     ["泽水困 (兑宫)", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  子孙午火″", "  妻财辰土′", "  兄弟寅木″"],
     ["泽地萃 (兑宫)", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  兄弟卯木″", "  子孙巳火″", "  妻财未土″"],
     ["泽山咸 (兑宫)", "  妻财未土″", "  官鬼酉金′", "  父母亥水′", "  官鬼申金′", "  子孙午火″", "  妻财辰土″"],
     ["水山蹇 (兑宫)", "  父母子水″", "  妻财戌土′", "  官鬼申金″", "  官鬼申金′", "  子孙午火″", "  妻财辰土″"],
     ["地山谦 (兑宫)", "  官鬼酉金″", "  父母亥水″", "  妻财丑土″", "  官鬼申金′", "  子孙午火″", "  妻财辰土″"],
     ["雷山小过 (兑宫)", "  妻财戌土″", "  官鬼申金″", "  子孙午火′", "  官鬼申金′", "  子孙午火″", "  妻财辰土″"],
     ["雷泽归妹 (兑宫,归魂)", "  妻财戌土″", "  官鬼申金″", "  子孙午火′", "  妻财丑土″", "  兄弟卯木′",
      "  子孙巳火′"]],  # guagong4
    [["乾为天 (乾宫)", "  父母戌土′", "  兄弟申金′", "  官鬼午火′", "  父母辰土′", "  妻财寅木′", "  子孙子水′"],
     ["天风姤 (乾宫)", "  父母戌土′", "  兄弟申金′", "  官鬼午火′", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″"],
     ["天山遁 (乾宫)", "  父母戌土′", "  兄弟申金′", "  官鬼午火′", "  兄弟申金′", "  官鬼午火″", "  父母辰土″"],
     ["天地否 (乾宫)", "  父母戌土′", "  兄弟申金′", "  官鬼午火′", "  妻财卯木″", "  官鬼巳火″", "  父母未土″"],
     ["风地观 (乾宫)", "  妻财卯木′", "  官鬼巳火′", "  父母未土″", "  妻财卯木″", "  官鬼巳火″", "  父母未土″"],
     ["山地剥 (乾宫)", "  妻财寅木′", "  子孙子水″", "  父母戌土″", "  妻财卯木″", "  官鬼巳火″", "  父母未土″"],
     ["火地晋 (乾宫)", "  官鬼巳火′", "  父母未土″", "  兄弟酉金′", "  妻财卯木″", "  官鬼巳火″", "  父母未土″"],
     ["火天大有 (乾宫,归魂)", "  官鬼巳火′", "  父母未土″", "  兄弟酉金′", "  父母辰土′", "  妻财寅木′", "  子孙子水′"],
     ["震为雷 (震宫)", "  父母戌土″", "  兄弟申金″", "  官鬼午火′", "  父母辰土″", "  妻财寅木″", "  子孙子水′"],
     ["雷地豫 (震宫)", "  父母戌土″", "  兄弟申金″", "  官鬼午火′ ", "  妻财卯木″", "  官鬼巳火″", "  父母未土″"],
     ["雷水解 (震宫)", "  父母戌土″", "  兄弟申金″", "  官鬼午火′", "  官鬼午火″", "  父母辰土′", "  妻财寅木″"],
     ["雷风恒 (震宫)", "  父母戌土″", "  兄弟申金″", "  官鬼午火′", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″"],
     ["地风升 (震宫)", "  兄弟酉金″", "  子孙亥水″", "  父母丑土″", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″"],
     ["水风井 (震宫)", "  子孙子水″", "  父母戌土′", "  兄弟申金″", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″"],
     ["泽风大过 (震宫)", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″"],
     ["泽雷随 (震宫,归魂)", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  父母辰土″", "  妻财寅木″", "  子孙子水′"],
     ["坎为水 (坎宫)", "  子孙子水″", "  父母戌土′", "  兄弟申金″", "  官鬼午火″", "  父母辰土′", "  妻财寅木″"],
     ["水泽节 (坎宫)", "  子孙子水″", "  父母戌土′", "  兄弟申金″", "  父母丑土″", "  妻财卯木′", "  官鬼巳火′"],
     ["水雷屯 (坎宫)", "  子孙子水″", "  父母戌土′", "  兄弟申金″", "  父母辰土″", "  妻财寅木″", "  子孙子水′"],
     ["水火既济 (坎宫)", "  子孙子水″", "  父母戌土′", "  兄弟申金″", "  子孙亥水′", "  父母丑土″", "  妻财卯木′"],
     ["泽火革 (坎宫)", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  子孙亥水′", "  父母丑土″", "  妻财卯木′"],
     ["雷火丰 (坎宫)", "  父母戌土″", "  兄弟申金″", "  官鬼午火′", "  子孙亥水′", "  父母丑土″", "  妻财卯木′"],
     ["地火明夷 (坎宫)", "  兄弟酉金″", "  子孙亥水″", "  父母丑土″", "  子孙亥水′", "  父母丑土″", "  妻财卯木′"],
     ["地水师 (坎宫,归魂)", "  兄弟酉金″", "  子孙亥水″", "  父母丑土″", "  官鬼午火″", "  父母辰土′", "  妻财寅木″"],
     ["巽为风 (巽宫)", "  妻财卯木′", "  官鬼巳火′", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″"],
     ["风天小畜 (巽宫)", "  妻财卯木′", "  官鬼巳火′", "  父母未土″", "  父母辰土′", "  妻财寅木′", "  子孙子水′"],
     ["风火家人 (巽宫)", "  妻财卯木′", "  官鬼巳火′", "  父母未土″", "  子孙亥水′", "  父母丑土″", "  妻财卯木′"],
     ["风雷益 (巽宫)", "  妻财卯木′", "  官鬼巳火′", "  父母未土″", "  父母辰土″", "  妻财寅木″", "  子孙子水′"],
     ["天雷无妄 (巽宫)", "  父母戌土′", "  兄弟申金′", "  官鬼午火′", "  父母辰土″", "  妻财寅木″", "  子孙子水′"],
     ["火雷噬嗑 (巽宫)", "  官鬼巳火′", "  父母未土″", "  兄弟酉金′", "  父母辰土″", "  妻财寅木″", "  子孙子水′"],
     ["山雷颐 (巽宫)", "  妻财寅木′", "  子孙子水″", "  父母戌土″", "  父母辰土″", "  妻财寅木″", "  子孙子水′"],
     ["山风蛊 (巽宫,归魂)", "  妻财寅木′", "  子孙子水″", "  父母戌土″", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″"],
     ["艮为山 (艮宫)", "  妻财寅木′", "  子孙子水″", "  父母戌土″", "  兄弟申金′", "  官鬼午火″", "  父母辰土″"],
     ["山火贲 (艮宫)", "  妻财寅木′", "  子孙子水″", "  父母戌土″", "  子孙亥水′", "  父母丑土″", "  妻财卯木′"],
     ["山天大畜 (艮宫)", "  妻财寅木′", "  子孙子水″", "  父母戌土″", "  父母辰土′", "  妻财寅木′", "  子孙子水′"],
     ["山泽损 (艮宫)", "  妻财寅木′", "  子孙子水″", "  父母戌土″", "  父母丑土″", "  妻财卯木′", "  官鬼巳火′"],
     ["火泽睽 (艮宫)", "  官鬼巳火′", "  父母未土″", "  兄弟酉金′", "  父母丑土″", "  妻财卯木′", "  官鬼巳火′"],
     ["天泽履 (艮宫)", "  父母戌土′", "  兄弟申金′", "  官鬼午火′", "  父母丑土″", "  妻财卯木′", "  官鬼巳火′"],
     ["风泽中孚 (艮宫)", "  妻财卯木′", "  官鬼巳火′", "  父母未土″", "  父母丑土″", "  妻财卯木′", "  官鬼巳火′"],
     ["风山渐 (艮宫,归魂)", "  妻财卯木′", "  官鬼巳火′", "  父母未土″", "  兄弟申金′", "  官鬼午火″", "  父母辰土″"],
     ["坤为地 (坤宫)", "  兄弟酉金″", "  子孙亥水″", "  父母丑土″", "  妻财卯木″", "  官鬼巳火″", "  父母未土″"],
     ["地雷复 (坤宫)", "  兄弟酉金″", "  子孙亥水″", "  父母丑土″", "  父母辰土″", "  妻财寅木″", "  子孙子水′"],
     ["地泽临 (坤宫)", "  兄弟酉金″", "  子孙亥水″", "  父母丑土″", "  父母丑土″", "  妻财卯木′", "  官鬼巳火′"],
     ["地天泰 (坤宫)", "  兄弟酉金″", "  子孙亥水″", "  父母丑土″", "  父母辰土′", "  妻财寅木′", "  子孙子水′"],
     ["雷天大壮 (坤宫)", "  父母戌土″", "  兄弟申金″", "  官鬼午火′", "  父母辰土′", "  妻财寅木′", "  子孙子水′"],
     ["泽天夬 (坤宫)", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  父母辰土′", "  妻财寅木′", "  子孙子水′"],
     ["水天需 (坤宫)", "  子孙子水″", "  父母戌土′", "  兄弟申金″", "  父母辰土′", "  妻财寅木′", "  子孙子水′"],
     ["水地比 (坤宫,归魂)", "  子孙子水″", "  父母戌土′", "  兄弟申金″", "  妻财卯木″", "  官鬼巳火″", "  父母未土″"],
     ["离为火 (离宫)", "  官鬼巳火′", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″", "  妻财卯木′"],
     ["火山旅 (离宫)", "  官鬼巳火′", "  父母未土″", "  兄弟酉金′ ", "  兄弟申金′", "  官鬼午火″", "  父母辰土″"],
     ["火风鼎 (离宫)", "  官鬼巳火′", "  父母未土″", "  兄弟酉金′", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″"],
     ["火水未济 (离宫)", "  官鬼巳火′ ", "  父母未土″", "  兄弟酉金′", "  官鬼午火″", "  父母辰土′", "  妻财寅木″"],
     ["山水蒙 (离宫)", "  妻财寅木′", "  子孙子水″", "  父母戌土″", "  官鬼午火″", "  父母辰土′", "  妻财寅木″"],
     ["风水涣 (离宫)", "  妻财卯木′", "  官鬼巳火′", "  父母未土″", "  官鬼午火″", "  父母辰土′", "  妻财寅木″"],
     ["天水讼 (离宫)", "  父母戌土′", "  兄弟申金′", "  官鬼午火′", "  官鬼午火″", "  父母辰土′", "  妻财寅木″"],
     ["天火同人 (离宫,归魂)", "  父母戌土′", "  兄弟申金′", "  官鬼午火′", "  子孙亥水′", "  父母丑土″", "  妻财卯木′"],
     ["兑为泽 (兑宫)", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  父母丑土″", "  妻财卯木′", "  官鬼巳火′"],
     ["泽水困 (兑宫)", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  官鬼午火″", "  父母辰土′", "  妻财寅木″"],
     ["泽地萃 (兑宫)", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  妻财卯木″", "  官鬼巳火″", "  父母未土″"],
     ["泽山咸 (兑宫)", "  父母未土″", "  兄弟酉金′", "  子孙亥水′", "  兄弟申金′", "  官鬼午火″", "  父母辰土″"],
     ["水山蹇 (兑宫)", "  子孙子水″", "  父母戌土′", "  兄弟申金″", "  兄弟申金′", "  官鬼午火″", "  父母辰土″"],
     ["地山谦 (兑宫)", "  兄弟酉金″", "  子孙亥水″", "  父母丑土″", "  兄弟申金′", "  官鬼午火″", "  父母辰土″"],
     ["雷山小过 (兑宫)", "  父母戌土″", "  兄弟申金″", "  官鬼午火′", "  兄弟申金′", "  官鬼午火″", "  父母辰土″"],
     ["雷泽归妹 (兑宫,归魂)", "  父母戌土″", "  兄弟申金″", "  官鬼午火′", "  父母丑土″", "  妻财卯木′", "  官鬼巳火′"]]
]
animals = ["青龙", "朱雀", "勾陈", "腾蛇", "白虎", "玄武"]
xiantian_bagua = [[2, 2, 2], [1, 1, 1], [2, 1, 1], [1, 2, 1], [2, 2, 1], [1, 1, 2], [2, 1, 2], [1, 2, 2]]
yingyang = ["▆  ▆", "▆▆▆"]
space_vary_sign = ["  ", "○", "×"]


def gua_calculate(coinsNumber_list):
    if len(coinsNumber_list) != 6 or not all([r in [0, 1, 2, 3] for r in coinsNumber_list]):
        return False
        # messagebox.showerror("错误提示", "输入无效，请重新输入 6 个有效的 0、1、2 或 3。")
    else:
        gua_li = [1 if r == 3 else 2 if r == 0 else r for r in coinsNumber_list]  # 列表 coinsNumber_list 中的每个元素根据其值进行映射
        biangua_li = [2 if r == 3 else 1 if r == 0 else r for r in coinsNumber_list]
        a6, a5, a4, a3, a2, a1 = [1 if r in [3, 0] else 0 for r in coinsNumber_list]
        trigger_li = [a6, a1, a2, a3, a4, a5]
        gua_num = r_to_g[tuple(gua_li)]
        if all(r in [1, 2] for r in coinsNumber_list):
            biangua_num = 64
        else:
            biangua_num = r_to_g[tuple(biangua_li)]
        return trigger_li, gua_num, biangua_num


convert_to_Wx = [4, 3, 1, 3, 0, 0, 2, 4]


def h_caculate(g, h):
    if g in range(0, 8) or g in range(56, 64):
        guagong_wuxing = 4
    elif g in range(8, 16) or g in range(24, 32):
        guagong_wuxing = 3
    elif g in range(16, 24):
        guagong_wuxing = 1
    elif g in range(32, 48):
        guagong_wuxing = 0
    else:
        guagong_wuxing = 2
    if h in [1, 2]:
        liushen_moshi = 1
    elif h in [3, 4]:
        liushen_moshi = 2
    elif h == 5:
        liushen_moshi = 3
    elif h == 6:
        liushen_moshi = 4
    elif h in [7, 8]:
        liushen_moshi = 5
    else:  # h in [9, 10]:改0好不好？？？？[0,1,1,2,2,3,4,5,5,0]
        liushen_moshi = 0
    return guagong_wuxing, liushen_moshi


# {4,3,1,3,0,2,4}{0,1,1,2,2,3,4,5,5,0}

def liuyao_caculate(g, h1, h2, f, trigger_list: list):
    if not all(num in [0, 1] for num in trigger_list):
        print("trigger_list[]列表的数值有误。", trigger_list)
        # 注意此处trigger_list是【六，初，二，三，四，五】
    """
    g为主卦数，f变卦数，a是动爻组
    h1为卦宫五行，h2为六神模式
    l0行出错的话，进行以下调试：
    print("h2:", h2)
    print("g:", g)
    """

    l0 = guaxiang[g][0] if f == 64 else (guaxiang[g][0] + "   " + guaxiang[f][0])
    """
    l6行出错的话：进行调试：
    print("a:", a)
    """
    l6 = animals[(h2 + 4) % 6] + " " + guaxiang[g][1] + (
        guaxiang[g][2 + trigger_list[0]] if trigger_list[0] == 0 else guaxiang[g][2 + trigger_list[0]] + biangua[h1][f][
            1])
    l5 = animals[(h2 + 3) % 6] + " " + guaxiang[g][4] + (
        guaxiang[g][5 + trigger_list[5]] if trigger_list[5] == 0 else guaxiang[g][5 + trigger_list[5]] + biangua[h1][f][
            2])
    l4 = animals[(h2 + 2) % 6] + " " + guaxiang[g][7] + (
        guaxiang[g][8 + trigger_list[4]] if trigger_list[4] == 0 else guaxiang[g][8 + trigger_list[4]] + biangua[h1][f][
            3])
    l3 = animals[(h2 + 1) % 6] + " " + guaxiang[g][10] + (
        guaxiang[g][11 + trigger_list[3]] if trigger_list[3] == 0 else guaxiang[g][11 + trigger_list[3]] +
                                                                       biangua[h1][f][4])
    l2 = animals[(h2 + 0) % 6] + " " + guaxiang[g][13] + (
        guaxiang[g][14 + trigger_list[2]] if trigger_list[2] == 0 else guaxiang[g][14 + trigger_list[2]] +
                                                                       biangua[h1][f][5])
    l1 = animals[(h2 + 5) % 6] + " " + guaxiang[g][16] + (
        guaxiang[g][17 + trigger_list[1]] if trigger_list[1] == 0 else guaxiang[g][17 + trigger_list[1]] +
                                                                       biangua[h1][f][6])
    return l0, l1, l2, l3, l4, l5, l6


def process_list(coinsNumber_list):
    import datetime

    current_time = datetime.datetime.now()
    hour = current_time.hour
    hour_zhi = ((hour + 3) // 2) % 12
    if hour_zhi == 0:
        hour_zhi = 12
    print("你选择了这个时辰>>>", hour_zhi)

    if all(isinstance(x, int) for x in coinsNumber_list):
        length = len(coinsNumber_list)
        k = (length - 1) / 2 if length % 2 == 1 else length / 2 - 1
        total, last = sum(coinsNumber_list), coinsNumber_list[-1]

        if length == 1:
            coinsNumber_list = [str(coinsNumber_list[0])]

            if len(coinsNumber_list[0]) >= 1:  # 只输入一个个位数，不行。
                coinsNumber_list = list(map(int, coinsNumber_list[0].split('')))
                process_list(coinsNumber_list)
            else:
                print("只输入一个个位数，乾坤未定。")

        elif length == 2:
            gua3 = (total + hour_zhi) % 6  # 动爻加时辰
            result_lst = [coinsNumber_list[0] % 8, coinsNumber_list[1] % 8, gua3]

        elif length == 3:
            result_lst = [coinsNumber_list[0] % 8, coinsNumber_list[1] % 8, total % 6]

        elif length == 4:  # 时间起卦的计算方法
            result_lst = [(total - last) % 8, total % 8, total % 6]

        elif length % 2 == 0:
            gua3 = (total + hour_zhi) % 6  # 动爻加时辰
            gua1 = sum(coinsNumber_list[:int(k) + 1]) % 8
            gua2 = sum(coinsNumber_list[int(k) + 1:]) % 8
            result_lst = [gua1, gua2, gua3]
        else:
            gua1 = sum(coinsNumber_list[:int(k) + 1]) % 8
            gua2 = sum(coinsNumber_list[int(k) + 2:]) % 8
            result_lst = [gua1, gua2, total % 6]
        # print("请确认是这个先天数组合吗？>>>", result_lst, "算法：2k+1奇数数列1到k+1为上卦，2k偶数数列1到k为上卦。")
        return result_lst

    else:
        print("输入的内容不是纯数字！")


def lunar_convert_to_num(date_str: str):
    lunar_dict = [
        {'正月': 1, '二月': 2, '三月': 3, '四月': 4, '五月': 5, '六月': 6,
         '七月': 7, '八月': 8, '九月': 9, '十月': 10, '十一月': 11, '腊月': 12, },
        {'初一': 1, '初二': 2, '初三': 3, '初四': 4, '初五': 5, '初六': 6, '初七': 7, '初八': 8,
         '初九': 9, '初十': 10, '十一': 11, '十二': 12, '十三': 13, '十四': 14, '十五': 15, '十六': 16,
         '十七': 17, '十八': 18, '十九': 19, '二十': 20, '廿一': 21, '廿二': 22, '廿三': 23, '廿四': 24,
         '廿五': 25, '廿六': 26, '廿七': 27, '廿八': 28, '廿九': 29, '三十': 30, '三十一': 31, },
        {'子时': 1, '丑时': 2, '寅时': 3, '卯时': 4, '辰时': 5, '巳时': 6,
         '午时': 7, '未时': 8, '申时': 9, '酉时': 10, '戌时': 11, '亥时': 12, }
    ]

    # 映射输入的农历日期字符串到公历日期
    result_lst = [sub_dic[key] for sub_dic in lunar_dict for key in sub_dic.keys() if key in date_str]
    if len(result_lst) != 3:
        raise ValueError(f"'{date_str}' is not a valid lunar date.")

    from datetime import datetime
    now = datetime.now()
    current_year = now.year
    date_to_compare = datetime(now.year, 2, 4)
    diff = -1 if now < date_to_compare else 0
    year_zhi = ((current_year + diff - 2019) % 12 + 12) % 12
    year_zhi = 12 if year_zhi == 0 else year_zhi

    return [year_zhi] + result_lst
# example:lst = lunar_convert_to_num('腊月廿一未时')


def meihua_calucate(handle_lst):
    """
    :param
    r_list: 用户任意输入的数字，经process_list处理成上卦数、下卦数、总数加时辰为动爻数
    gi主卦序列，hi互卦序列，fi变卦序列，ci错卦序列
    :return:
    """
    Number_list = process_list(handle_lst)
    gi = xiantian_bagua[Number_list[0]] + xiantian_bagua[Number_list[1]]
    hi = [gi[1], gi[2], gi[3], gi[2], gi[3], gi[4]]
    fi = gi.copy()
    fi[-Number_list[2]] = 2 if fi[-Number_list[2]] == 1 else 1
    ci = [1 if num == 2 else 2 for num in gi]
    text = ""

    s = space_vary_sign[0]
    for i in range(1, 7):
        line = yingyang[gi[i - 1] % 2]
        line += space_vary_sign[gi[i - 1]] if i + Number_list[2] == 7 else s
        line += yingyang[hi[i - 1] % 2] + s + yingyang[fi[i - 1] % 2] + s + yingyang[ci[i - 1] % 2] + s + yingyang[
            ci[6 - i] % 2] + "\n"
        text += line
    text += " 主卦" + s + "  互卦" + s + "  变卦" + s + "  错卦" + s + "  综卦\n"

    return text
